/* automatically generated by rust-bindgen 0.66.1 */

#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::std::marker::PhantomData<T>, [T; 0]);
impl<T> __IncompleteArrayField<T> {
    #[inline]
    pub const fn new() -> Self {
        __IncompleteArrayField(::std::marker::PhantomData, [])
    }
    #[inline]
    pub fn as_ptr(&self) -> *const T {
        self as *const _ as *const T
    }
    #[inline]
    pub fn as_mut_ptr(&mut self) -> *mut T {
        self as *mut _ as *mut T
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::std::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::std::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl<T> ::std::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
pub const _STDIO_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;

pub const SDP_ATTR_HID_SUPERVISION_TIMEOUT: u32 = 524;
pub const SDP_ATTR_HID_NORMALLY_CONNECTABLE: u32 = 525;
pub const SDP_ATTR_HID_BOOT_DEVICE: u32 = 526;
pub const SDP_PRIMARY_LANG_BASE: u32 = 256;
pub const SDP_ATTR_SVCNAME_PRIMARY: u32 = 256;
pub const SDP_ATTR_SVCDESC_PRIMARY: u32 = 257;
pub const SDP_ATTR_PROVNAME_PRIMARY: u32 = 258;
pub const SDP_DATA_NIL: u32 = 0;
pub const SDP_UINT8: u32 = 8;
pub const SDP_UINT16: u32 = 9;
pub const SDP_UINT32: u32 = 10;
pub const SDP_UINT64: u32 = 11;
pub const SDP_UINT128: u32 = 12;
pub const SDP_INT8: u32 = 16;
pub const SDP_INT16: u32 = 17;
pub const SDP_INT32: u32 = 18;
pub const SDP_INT64: u32 = 19;
pub const SDP_INT128: u32 = 20;
pub const SDP_UUID_UNSPEC: u32 = 24;
pub const SDP_UUID16: u32 = 25;
pub const SDP_UUID32: u32 = 26;
pub const SDP_UUID128: u32 = 28;
pub const SDP_TEXT_STR_UNSPEC: u32 = 32;
pub const SDP_TEXT_STR8: u32 = 37;
pub const SDP_TEXT_STR16: u32 = 38;
pub const SDP_TEXT_STR32: u32 = 39;
pub const SDP_BOOL: u32 = 40;
pub const SDP_SEQ_UNSPEC: u32 = 48;
pub const SDP_SEQ8: u32 = 53;
pub const SDP_SEQ16: u32 = 54;
pub const SDP_SEQ32: u32 = 55;
pub const SDP_ALT_UNSPEC: u32 = 56;
pub const SDP_ALT8: u32 = 61;
pub const SDP_ALT16: u32 = 62;
pub const SDP_ALT32: u32 = 63;
pub const SDP_URL_STR_UNSPEC: u32 = 64;
pub const SDP_URL_STR8: u32 = 69;
pub const SDP_URL_STR16: u32 = 70;
pub const SDP_URL_STR32: u32 = 71;
pub const SDP_ERROR_RSP: u32 = 1;
pub const SDP_SVC_SEARCH_REQ: u32 = 2;
pub const SDP_SVC_SEARCH_RSP: u32 = 3;
pub const SDP_SVC_ATTR_REQ: u32 = 4;
pub const SDP_SVC_ATTR_RSP: u32 = 5;
pub const SDP_SVC_SEARCH_ATTR_REQ: u32 = 6;
pub const SDP_SVC_SEARCH_ATTR_RSP: u32 = 7;
pub const SDP_SVC_REGISTER_REQ: u32 = 117;
pub const SDP_SVC_REGISTER_RSP: u32 = 118;
pub const SDP_SVC_UPDATE_REQ: u32 = 119;
pub const SDP_SVC_UPDATE_RSP: u32 = 120;
pub const SDP_SVC_REMOVE_REQ: u32 = 121;
pub const SDP_SVC_REMOVE_RSP: u32 = 128;
pub const SDP_INVALID_VERSION: u32 = 1;
pub const SDP_INVALID_RECORD_HANDLE: u32 = 2;
pub const SDP_INVALID_SYNTAX: u32 = 3;
pub const SDP_INVALID_PDU_SIZE: u32 = 4;
pub const SDP_INVALID_CSTATE: u32 = 5;
pub const SDP_RECORD_PERSIST: u32 = 1;
pub const SDP_DEVICE_RECORD: u32 = 2;
pub const SDP_RETRY_IF_BUSY: u32 = 1;
pub const SDP_WAIT_ON_CLOSE: u32 = 2;
pub const SDP_NON_BLOCKING: u32 = 4;
pub const SDP_LARGE_MTU: u32 = 8;
pub const MAX_LEN_UUID_STR: u32 = 37;
pub const MAX_LEN_PROTOCOL_UUID_STR: u32 = 8;
pub const MAX_LEN_SERVICECLASS_UUID_STR: u32 = 28;
pub const MAX_LEN_PROFILEDESCRIPTOR_UUID_STR: u32 = 28;
pub type wchar_t = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __max_align_ll: ::std::os::raw::c_longlong,
    pub __max_align_ld: f64,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    const UNINIT: ::std::mem::MaybeUninit<max_align_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        16usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        8usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__max_align_ll) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__max_align_ll)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__max_align_ld) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__max_align_ld)
        )
    );
}
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_longlong;
pub type __uint64_t = ::std::os::raw::c_ulonglong;
pub type __quad_t = ::std::os::raw::c_longlong;
pub type __u_quad_t = ::std::os::raw::c_ulonglong;
pub type __dev_t = __u_quad_t;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = __u_quad_t;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_uint;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = __quad_t;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    const UNINIT: ::std::mem::MaybeUninit<__fsid_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = __u_quad_t;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = __quad_t;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = __u_quad_t;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = __u_quad_t;
pub type __fsword_t = ::std::os::raw::c_int;
pub type __ssize_t = ::std::os::raw::c_int;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __qaddr_t = *mut __quad_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_int;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type FILE = _IO_FILE;
pub type __FILE = _IO_FILE;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
}
#[test]
fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<__mbstate_t__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Size of: ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wch) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wch)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wchb) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t__bindgen_ty_1),
            "::",
            stringify!(__wchb)
        )
    );
}
#[test]
fn bindgen_test_layout___mbstate_t() {
    const UNINIT: ::std::mem::MaybeUninit<__mbstate_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__mbstate_t>(),
        8usize,
        concat!("Size of: ", stringify!(__mbstate_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__mbstate_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__mbstate_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__count) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__value) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(__mbstate_t),
            "::",
            stringify!(__value)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos_t() {
    const UNINIT: ::std::mem::MaybeUninit<_G_fpos_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_G_fpos_t>(),
        12usize,
        concat!("Size of: ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_G_fpos_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pos) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__state) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos_t),
            "::",
            stringify!(__state)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[test]
fn bindgen_test_layout__G_fpos64_t() {
    const UNINIT: ::std::mem::MaybeUninit<_G_fpos64_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_G_fpos64_t>(),
        16usize,
        concat!("Size of: ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        ::std::mem::align_of::<_G_fpos64_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_G_fpos64_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pos) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__pos)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__state) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_G_fpos64_t),
            "::",
            stringify!(__state)
        )
    );
}
pub type __gnuc_va_list = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_jump_t {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    pub _next: *mut _IO_marker,
    pub _sbuf: *mut _IO_FILE,
    pub _pos: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout__IO_marker() {
    const UNINIT: ::std::mem::MaybeUninit<_IO_marker> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_IO_marker>(),
        12usize,
        concat!("Size of: ", stringify!(_IO_marker))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_marker>(),
        4usize,
        concat!("Alignment of ", stringify!(_IO_marker))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_marker),
            "::",
            stringify!(_next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._sbuf) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_marker),
            "::",
            stringify!(_sbuf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._pos) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_marker),
            "::",
            stringify!(_pos)
        )
    );
}
pub const __codecvt_result___codecvt_ok: __codecvt_result = 0;
pub const __codecvt_result___codecvt_partial: __codecvt_result = 1;
pub const __codecvt_result___codecvt_error: __codecvt_result = 2;
pub const __codecvt_result___codecvt_noconv: __codecvt_result = 3;
pub type __codecvt_result = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub __pad1: *mut ::std::os::raw::c_void,
    pub __pad2: *mut ::std::os::raw::c_void,
    pub __pad3: *mut ::std::os::raw::c_void,
    pub __pad4: *mut ::std::os::raw::c_void,
    pub __pad5: usize,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 40usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    const UNINIT: ::std::mem::MaybeUninit<_IO_FILE> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_IO_FILE>(),
        152usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_ptr) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_end) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_base) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_base) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_ptr) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_end) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_buf_base) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_buf_end) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_save_base) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_backup_base) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_backup_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_save_end) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._markers) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_markers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._chain) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_chain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._fileno) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_fileno)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._flags2) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._old_offset) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_old_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._cur_column) as usize - ptr as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_cur_column)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._vtable_offset) as usize - ptr as usize },
        70usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_vtable_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._shortbuf) as usize - ptr as usize },
        71usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_shortbuf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._lock) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._offset) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad1) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad2) as usize - ptr as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad3) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad3)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad4) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad4)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad5) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._mode) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._unused2) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_unused2)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE_plus {
    _unused: [u8; 0],
}
extern "C" {
    pub static mut _IO_2_1_stdin_: _IO_FILE_plus;
}
extern "C" {
    pub static mut _IO_2_1_stdout_: _IO_FILE_plus;
}
extern "C" {
    pub static mut _IO_2_1_stderr_: _IO_FILE_plus;
}
pub type __io_read_fn = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __buf: *mut ::std::os::raw::c_char,
        __nbytes: usize,
    ) -> __ssize_t,
>;
pub type __io_write_fn = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __buf: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> __ssize_t,
>;
pub type __io_seek_fn = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __pos: *mut __off64_t,
        __w: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type __io_close_fn = ::std::option::Option<
    unsafe extern "C" fn(__cookie: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn __underflow(arg1: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __uflow(arg1: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __overflow(arg1: *mut _IO_FILE, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_getc(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_putc(__c: ::std::os::raw::c_int, __fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_feof(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_ferror(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_peekc_locked(__fp: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_flockfile(arg1: *mut _IO_FILE);
}
extern "C" {
    pub fn _IO_funlockfile(arg1: *mut _IO_FILE);
}
extern "C" {
    pub fn _IO_ftrylockfile(arg1: *mut _IO_FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_vfscanf(
        arg1: *mut _IO_FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: __gnuc_va_list,
        arg4: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_vfprintf(
        arg1: *mut _IO_FILE,
        arg2: *const ::std::os::raw::c_char,
        arg3: __gnuc_va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _IO_padn(arg1: *mut _IO_FILE, arg2: ::std::os::raw::c_int, arg3: __ssize_t)
        -> __ssize_t;
}
extern "C" {
    pub fn _IO_sgetn(arg1: *mut _IO_FILE, arg2: *mut ::std::os::raw::c_void, arg3: usize) -> usize;
}
extern "C" {
    pub fn _IO_seekoff(
        arg1: *mut _IO_FILE,
        arg2: __off64_t,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
    ) -> __off64_t;
}
extern "C" {
    pub fn _IO_seekpos(
        arg1: *mut _IO_FILE,
        arg2: __off64_t,
        arg3: ::std::os::raw::c_int,
    ) -> __off64_t;
}
extern "C" {
    pub fn _IO_free_backup_area(arg1: *mut _IO_FILE);
}
pub type va_list = __gnuc_va_list;
pub type off_t = __off_t;
pub type fpos_t = _G_fpos_t;
extern "C" {
    pub static mut stdin: *mut _IO_FILE;
}
extern "C" {
    pub static mut stdout: *mut _IO_FILE;
}
extern "C" {
    pub static mut stderr: *mut _IO_FILE;
}
extern "C" {
    pub fn remove(__filename: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renameat(
        __oldfd: ::std::os::raw::c_int,
        __old: *const ::std::os::raw::c_char,
        __newfd: ::std::os::raw::c_int,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tmpnam_r(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __pfx: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn freopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fdopen(__fd: ::std::os::raw::c_int, __modes: *const ::std::os::raw::c_char)
        -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(
        __s: *mut ::std::os::raw::c_void,
        __len: usize,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(
        __bufloc: *mut *mut ::std::os::raw::c_char,
        __sizeloc: *mut usize,
    ) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut ::std::os::raw::c_char,
        __modes: ::std::os::raw::c_int,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char, __size: usize);
}
extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
    pub fn fprintf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn printf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: u32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vprintf(__format: *const ::std::os::raw::c_char, __arg: u32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: u32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_uint,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_uint,
        __format: *const ::std::os::raw::c_char,
        __arg: u32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vdprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        __arg: __gnuc_va_list,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scanf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: u32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vscanf(__format: *const ::std::os::raw::c_char, __arg: u32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: u32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: u32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(__format: *const ::std::os::raw::c_char, __arg: u32) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: u32,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar_unlocked(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(__w: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getline(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn fputs(__s: *const ::std::os::raw::c_char, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_uint,
        __n: ::std::os::raw::c_uint,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: ::std::os::raw::c_uint,
        __n: ::std::os::raw::c_uint,
        __s: *mut FILE,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: ::std::os::raw::c_long,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __off: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
extern "C" {
    pub static mut sys_nerr: ::std::os::raw::c_int;
}
extern "C" {
    pub static sys_errlist: [*const ::std::os::raw::c_char; 0usize];
}
extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn popen(
        __command: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ctermid(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_longlong;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulonglong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_int;
pub type int_fast32_t = ::std::os::raw::c_int;
pub type int_fast64_t = ::std::os::raw::c_longlong;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_uint;
pub type uint_fast32_t = ::std::os::raw::c_uint;
pub type uint_fast64_t = ::std::os::raw::c_ulonglong;
pub type intmax_t = ::std::os::raw::c_longlong;
pub type uintmax_t = ::std::os::raw::c_ulonglong;
extern "C" {
    pub fn memcpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memmove(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memccpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memset(
        __s: *mut ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memchr(
        __s: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn strcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcoll(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_uint;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[test]
fn bindgen_test_layout___locale_struct() {
    const UNINIT: ::std::mem::MaybeUninit<__locale_struct> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__locale_struct>(),
        116usize,
        concat!("Size of: ", stringify!(__locale_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<__locale_struct>(),
        4usize,
        concat!("Alignment of ", stringify!(__locale_struct))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__locales) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__locales)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ctype_b) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_b)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ctype_tolower) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_tolower)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ctype_toupper) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__ctype_toupper)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__names) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(__locale_struct),
            "::",
            stringify!(__names)
        )
    );
}
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
extern "C" {
    pub fn strcoll_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __l: __locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm_l(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
        __l: __locale_t,
    ) -> usize;
}
extern "C" {
    pub fn strdup(__s: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strndup(
        __string: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strrchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcspn(
        __s: *const ::std::os::raw::c_char,
        __reject: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn strspn(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn strpbrk(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strstr(
        __haystack: *const ::std::os::raw::c_char,
        __needle: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strlen(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn strnlen(__string: *const ::std::os::raw::c_char, __maxlen: usize) -> usize;
}
extern "C" {
    pub fn strerror(__errnum: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "\u{1}__xpg_strerror_r"]
    pub fn strerror_r(
        __errnum: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strerror_l(
        __errnum: ::std::os::raw::c_int,
        __l: __locale_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __bzero(__s: *mut ::std::os::raw::c_void, __n: usize);
}
extern "C" {
    pub fn bcopy(
        __src: *const ::std::os::raw::c_void,
        __dest: *mut ::std::os::raw::c_void,
        __n: usize,
    );
}
extern "C" {
    pub fn bzero(__s: *mut ::std::os::raw::c_void, __n: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn bcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn index(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn rindex(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ffs(__i: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strsep(
        __stringp: *mut *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strsignal(__sig: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_uint,
    ) -> *mut ::std::os::raw::c_char;
}
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type time_t = __time_t;
pub type clockid_t = __clockid_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = ::std::os::raw::c_uchar;
pub type u_int16_t = ::std::os::raw::c_ushort;
pub type u_int32_t = ::std::os::raw::c_uint;
pub type u_int64_t = ::std::os::raw::c_ulonglong;
pub type register_t = ::std::os::raw::c_int;
pub type __sig_atomic_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 32usize],
}
#[test]
fn bindgen_test_layout___sigset_t() {
    const UNINIT: ::std::mem::MaybeUninit<__sigset_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__sigset_t>(),
        128usize,
        concat!("Size of: ", stringify!(__sigset_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__sigset_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__sigset_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__sigset_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[test]
fn bindgen_test_layout_timespec() {
    const UNINIT: ::std::mem::MaybeUninit<timespec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timespec>(),
        8usize,
        concat!("Size of: ", stringify!(timespec))
    );
    assert_eq!(
        ::std::mem::align_of::<timespec>(),
        4usize,
        concat!("Alignment of ", stringify!(timespec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_nsec) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(timespec),
            "::",
            stringify!(tv_nsec)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[test]
fn bindgen_test_layout_timeval() {
    const UNINIT: ::std::mem::MaybeUninit<timeval> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<timeval>(),
        8usize,
        concat!("Size of: ", stringify!(timeval))
    );
    assert_eq!(
        ::std::mem::align_of::<timeval>(),
        4usize,
        concat!("Alignment of ", stringify!(timeval))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_sec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_sec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tv_usec) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(timeval),
            "::",
            stringify!(tv_usec)
        )
    );
}
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 32usize],
}
#[test]
fn bindgen_test_layout_fd_set() {
    const UNINIT: ::std::mem::MaybeUninit<fd_set> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<fd_set>(),
        128usize,
        concat!("Size of: ", stringify!(fd_set))
    );
    assert_eq!(
        ::std::mem::align_of::<fd_set>(),
        4usize,
        concat!("Alignment of ", stringify!(fd_set))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__fds_bits) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fd_set),
            "::",
            stringify!(__fds_bits)
        )
    );
}
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn gnu_dev_major(__dev: ::std::os::raw::c_ulonglong) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn gnu_dev_minor(__dev: ::std::os::raw::c_ulonglong) -> ::std::os::raw::c_uint;
}
extern "C" {
    pub fn gnu_dev_makedev(
        __major: ::std::os::raw::c_uint,
        __minor: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_ulonglong;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 36usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_attr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_attr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_attr_t>(),
        36usize,
        concat!("Size of: ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_attr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_attr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_attr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[test]
fn bindgen_test_layout___pthread_internal_slist() {
    const UNINIT: ::std::mem::MaybeUninit<__pthread_internal_slist> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__pthread_internal_slist>(),
        4usize,
        concat!("Size of: ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        ::std::mem::align_of::<__pthread_internal_slist>(),
        4usize,
        concat!("Alignment of ", stringify!(__pthread_internal_slist))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__next) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__pthread_internal_slist),
            "::",
            stringify!(__next)
        )
    );
}
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: pthread_mutex_t___pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 24usize],
    pub __align: ::std::os::raw::c_long,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct pthread_mutex_t___pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __kind: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __bindgen_anon_1: pthread_mutex_t___pthread_mutex_s__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t___pthread_mutex_s__bindgen_ty_1 {
    pub __spins: ::std::os::raw::c_int,
    pub __list: __pthread_slist_t,
}
#[test]
fn bindgen_test_layout_pthread_mutex_t___pthread_mutex_s__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_mutex_t___pthread_mutex_s__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t___pthread_mutex_s__bindgen_ty_1>(),
        4usize,
        concat!(
            "Size of: ",
            stringify!(pthread_mutex_t___pthread_mutex_s__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t___pthread_mutex_s__bindgen_ty_1>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(pthread_mutex_t___pthread_mutex_s__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__spins) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t___pthread_mutex_s__bindgen_ty_1),
            "::",
            stringify!(__spins)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__list) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t___pthread_mutex_s__bindgen_ty_1),
            "::",
            stringify!(__list)
        )
    );
}
#[test]
fn bindgen_test_layout_pthread_mutex_t___pthread_mutex_s() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_mutex_t___pthread_mutex_s> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t___pthread_mutex_s>(),
        24usize,
        concat!("Size of: ", stringify!(pthread_mutex_t___pthread_mutex_s))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t___pthread_mutex_s>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(pthread_mutex_t___pthread_mutex_s)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__lock) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t___pthread_mutex_s),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t___pthread_mutex_s),
            "::",
            stringify!(__count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__owner) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t___pthread_mutex_s),
            "::",
            stringify!(__owner)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__kind) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t___pthread_mutex_s),
            "::",
            stringify!(__kind)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__nusers) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t___pthread_mutex_s),
            "::",
            stringify!(__nusers)
        )
    );
}
#[test]
fn bindgen_test_layout_pthread_mutex_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_mutex_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_mutex_t>(),
        24usize,
        concat!("Size of: ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutex_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutex_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutex_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_mutexattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_mutexattr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_mutexattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_mutexattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_mutexattr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: pthread_cond_t__bindgen_ty_1,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_cond_t__bindgen_ty_1 {
    pub __lock: ::std::os::raw::c_int,
    pub __futex: ::std::os::raw::c_uint,
    pub __total_seq: ::std::os::raw::c_ulonglong,
    pub __wakeup_seq: ::std::os::raw::c_ulonglong,
    pub __woken_seq: ::std::os::raw::c_ulonglong,
    pub __mutex: *mut ::std::os::raw::c_void,
    pub __nwaiters: ::std::os::raw::c_uint,
    pub __broadcast_seq: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_pthread_cond_t__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_cond_t__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t__bindgen_ty_1>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__lock) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t__bindgen_ty_1),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__futex) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t__bindgen_ty_1),
            "::",
            stringify!(__futex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__total_seq) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t__bindgen_ty_1),
            "::",
            stringify!(__total_seq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__wakeup_seq) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t__bindgen_ty_1),
            "::",
            stringify!(__wakeup_seq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__woken_seq) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t__bindgen_ty_1),
            "::",
            stringify!(__woken_seq)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__mutex) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t__bindgen_ty_1),
            "::",
            stringify!(__mutex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__nwaiters) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t__bindgen_ty_1),
            "::",
            stringify!(__nwaiters)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__broadcast_seq) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t__bindgen_ty_1),
            "::",
            stringify!(__broadcast_seq)
        )
    );
}
#[test]
fn bindgen_test_layout_pthread_cond_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_cond_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_cond_t>(),
        48usize,
        concat!("Size of: ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_cond_t>(),
        8usize,
        concat!("Alignment of ", stringify!(pthread_cond_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_cond_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_condattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_condattr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_condattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_condattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_condattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_condattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: pthread_rwlock_t__bindgen_ty_1,
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct pthread_rwlock_t__bindgen_ty_1 {
    pub __lock: ::std::os::raw::c_int,
    pub __nr_readers: ::std::os::raw::c_uint,
    pub __readers_wakeup: ::std::os::raw::c_uint,
    pub __writer_wakeup: ::std::os::raw::c_uint,
    pub __nr_readers_queued: ::std::os::raw::c_uint,
    pub __nr_writers_queued: ::std::os::raw::c_uint,
    pub __flags: ::std::os::raw::c_uchar,
    pub __shared: ::std::os::raw::c_uchar,
    pub __pad1: ::std::os::raw::c_uchar,
    pub __pad2: ::std::os::raw::c_uchar,
    pub __writer: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_rwlock_t__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlock_t__bindgen_ty_1>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlock_t__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__lock) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__lock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__nr_readers) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__nr_readers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__readers_wakeup) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__readers_wakeup)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__writer_wakeup) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__writer_wakeup)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__nr_readers_queued) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__nr_readers_queued)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__nr_writers_queued) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__nr_writers_queued)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__flags) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__shared) as usize - ptr as usize },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__shared)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad1) as usize - ptr as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__pad1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad2) as usize - ptr as usize },
        27usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__pad2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__writer) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t__bindgen_ty_1),
            "::",
            stringify!(__writer)
        )
    );
}
#[test]
fn bindgen_test_layout_pthread_rwlock_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_rwlock_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlock_t>(),
        32usize,
        concat!("Size of: ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlock_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_rwlock_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlock_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_rwlockattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_rwlockattr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_rwlockattr_t>(),
        8usize,
        concat!("Size of: ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_rwlockattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_rwlockattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_rwlockattr_t),
            "::",
            stringify!(__align)
        )
    );
}
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 20usize],
    pub __align: ::std::os::raw::c_long,
}
#[test]
fn bindgen_test_layout_pthread_barrier_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_barrier_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_barrier_t>(),
        20usize,
        concat!("Size of: ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrier_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrier_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrier_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_pthread_barrierattr_t() {
    const UNINIT: ::std::mem::MaybeUninit<pthread_barrierattr_t> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Size of: ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<pthread_barrierattr_t>(),
        4usize,
        concat!("Alignment of ", stringify!(pthread_barrierattr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__align) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pthread_barrierattr_t),
            "::",
            stringify!(__align)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct iovec {
    pub iov_base: *mut ::std::os::raw::c_void,
    pub iov_len: usize,
}
#[test]
fn bindgen_test_layout_iovec() {
    const UNINIT: ::std::mem::MaybeUninit<iovec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<iovec>(),
        8usize,
        concat!("Size of: ", stringify!(iovec))
    );
    assert_eq!(
        ::std::mem::align_of::<iovec>(),
        4usize,
        concat!("Alignment of ", stringify!(iovec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iov_base) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(iovec),
            "::",
            stringify!(iov_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).iov_len) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(iovec),
            "::",
            stringify!(iov_len)
        )
    );
}
extern "C" {
    pub fn readv(
        __fd: ::std::os::raw::c_int,
        __iovec: *const iovec,
        __count: ::std::os::raw::c_int,
    ) -> isize;
}
extern "C" {
    pub fn writev(
        __fd: ::std::os::raw::c_int,
        __iovec: *const iovec,
        __count: ::std::os::raw::c_int,
    ) -> isize;
}
extern "C" {
    pub fn preadv(
        __fd: ::std::os::raw::c_int,
        __iovec: *const iovec,
        __count: ::std::os::raw::c_int,
        __offset: __off_t,
    ) -> isize;
}
extern "C" {
    pub fn pwritev(
        __fd: ::std::os::raw::c_int,
        __iovec: *const iovec,
        __count: ::std::os::raw::c_int,
        __offset: __off_t,
    ) -> isize;
}
pub type socklen_t = __socklen_t;
pub const __socket_type_SOCK_STREAM: __socket_type = 1;
pub const __socket_type_SOCK_DGRAM: __socket_type = 2;
pub const __socket_type_SOCK_RAW: __socket_type = 3;
pub const __socket_type_SOCK_RDM: __socket_type = 4;
pub const __socket_type_SOCK_SEQPACKET: __socket_type = 5;
pub const __socket_type_SOCK_DCCP: __socket_type = 6;
pub const __socket_type_SOCK_PACKET: __socket_type = 10;
pub const __socket_type_SOCK_CLOEXEC: __socket_type = 524288;
pub const __socket_type_SOCK_NONBLOCK: __socket_type = 2048;
pub type __socket_type = ::std::os::raw::c_uint;
pub type sa_family_t = ::std::os::raw::c_ushort;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr {
    pub sa_family: sa_family_t,
    pub sa_data: [::std::os::raw::c_char; 14usize],
}
#[test]
fn bindgen_test_layout_sockaddr() {
    const UNINIT: ::std::mem::MaybeUninit<sockaddr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sockaddr>(),
        16usize,
        concat!("Size of: ", stringify!(sockaddr))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr>(),
        2usize,
        concat!("Alignment of ", stringify!(sockaddr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_family) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr),
            "::",
            stringify!(sa_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_data) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr),
            "::",
            stringify!(sa_data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_storage {
    pub ss_family: sa_family_t,
    pub __ss_padding: [::std::os::raw::c_char; 122usize],
    pub __ss_align: ::std::os::raw::c_ulong,
}
#[test]
fn bindgen_test_layout_sockaddr_storage() {
    const UNINIT: ::std::mem::MaybeUninit<sockaddr_storage> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sockaddr_storage>(),
        128usize,
        concat!("Size of: ", stringify!(sockaddr_storage))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr_storage>(),
        4usize,
        concat!("Alignment of ", stringify!(sockaddr_storage))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ss_family) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(ss_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ss_padding) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(__ss_padding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__ss_align) as usize - ptr as usize },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_storage),
            "::",
            stringify!(__ss_align)
        )
    );
}
pub const MSG_OOB: _bindgen_ty_1 = 1;
pub const MSG_PEEK: _bindgen_ty_1 = 2;
pub const MSG_DONTROUTE: _bindgen_ty_1 = 4;
pub const MSG_CTRUNC: _bindgen_ty_1 = 8;
pub const MSG_PROXY: _bindgen_ty_1 = 16;
pub const MSG_TRUNC: _bindgen_ty_1 = 32;
pub const MSG_DONTWAIT: _bindgen_ty_1 = 64;
pub const MSG_EOR: _bindgen_ty_1 = 128;
pub const MSG_WAITALL: _bindgen_ty_1 = 256;
pub const MSG_FIN: _bindgen_ty_1 = 512;
pub const MSG_SYN: _bindgen_ty_1 = 1024;
pub const MSG_CONFIRM: _bindgen_ty_1 = 2048;
pub const MSG_RST: _bindgen_ty_1 = 4096;
pub const MSG_ERRQUEUE: _bindgen_ty_1 = 8192;
pub const MSG_NOSIGNAL: _bindgen_ty_1 = 16384;
pub const MSG_MORE: _bindgen_ty_1 = 32768;
pub const MSG_WAITFORONE: _bindgen_ty_1 = 65536;
pub const MSG_FASTOPEN: _bindgen_ty_1 = 536870912;
pub const MSG_CMSG_CLOEXEC: _bindgen_ty_1 = 1073741824;
pub type _bindgen_ty_1 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct msghdr {
    pub msg_name: *mut ::std::os::raw::c_void,
    pub msg_namelen: socklen_t,
    pub msg_iov: *mut iovec,
    pub msg_iovlen: usize,
    pub msg_control: *mut ::std::os::raw::c_void,
    pub msg_controllen: usize,
    pub msg_flags: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_msghdr() {
    const UNINIT: ::std::mem::MaybeUninit<msghdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<msghdr>(),
        28usize,
        concat!("Size of: ", stringify!(msghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<msghdr>(),
        4usize,
        concat!("Alignment of ", stringify!(msghdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_namelen) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_namelen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_iov) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_iov)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_iovlen) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_iovlen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_control) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_control)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_controllen) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_controllen)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msg_flags) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(msghdr),
            "::",
            stringify!(msg_flags)
        )
    );
}
#[repr(C)]
#[derive(Debug)]
pub struct cmsghdr {
    pub cmsg_len: usize,
    pub cmsg_level: ::std::os::raw::c_int,
    pub cmsg_type: ::std::os::raw::c_int,
    pub __cmsg_data: __IncompleteArrayField<::std::os::raw::c_uchar>,
}
#[test]
fn bindgen_test_layout_cmsghdr() {
    const UNINIT: ::std::mem::MaybeUninit<cmsghdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cmsghdr>(),
        12usize,
        concat!("Size of: ", stringify!(cmsghdr))
    );
    assert_eq!(
        ::std::mem::align_of::<cmsghdr>(),
        4usize,
        concat!("Alignment of ", stringify!(cmsghdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cmsg_len) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cmsghdr),
            "::",
            stringify!(cmsg_len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cmsg_level) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(cmsghdr),
            "::",
            stringify!(cmsg_level)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cmsg_type) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cmsghdr),
            "::",
            stringify!(cmsg_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__cmsg_data) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(cmsghdr),
            "::",
            stringify!(__cmsg_data)
        )
    );
}
extern "C" {
    pub fn __cmsg_nxthdr(__mhdr: *mut msghdr, __cmsg: *mut cmsghdr) -> *mut cmsghdr;
}
pub const SCM_RIGHTS: _bindgen_ty_2 = 1;
pub type _bindgen_ty_2 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct linger {
    pub l_onoff: ::std::os::raw::c_int,
    pub l_linger: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_linger() {
    const UNINIT: ::std::mem::MaybeUninit<linger> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<linger>(),
        8usize,
        concat!("Size of: ", stringify!(linger))
    );
    assert_eq!(
        ::std::mem::align_of::<linger>(),
        4usize,
        concat!("Alignment of ", stringify!(linger))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_onoff) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(linger),
            "::",
            stringify!(l_onoff)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).l_linger) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(linger),
            "::",
            stringify!(l_linger)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct osockaddr {
    pub sa_family: ::std::os::raw::c_ushort,
    pub sa_data: [::std::os::raw::c_uchar; 14usize],
}
#[test]
fn bindgen_test_layout_osockaddr() {
    const UNINIT: ::std::mem::MaybeUninit<osockaddr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<osockaddr>(),
        16usize,
        concat!("Size of: ", stringify!(osockaddr))
    );
    assert_eq!(
        ::std::mem::align_of::<osockaddr>(),
        2usize,
        concat!("Alignment of ", stringify!(osockaddr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_family) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(osockaddr),
            "::",
            stringify!(sa_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sa_data) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(osockaddr),
            "::",
            stringify!(sa_data)
        )
    );
}
pub const SHUT_RD: _bindgen_ty_3 = 0;
pub const SHUT_WR: _bindgen_ty_3 = 1;
pub const SHUT_RDWR: _bindgen_ty_3 = 2;
pub type _bindgen_ty_3 = ::std::os::raw::c_uint;
extern "C" {
    pub fn socket(
        __domain: ::std::os::raw::c_int,
        __type: ::std::os::raw::c_int,
        __protocol: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn socketpair(
        __domain: ::std::os::raw::c_int,
        __type: ::std::os::raw::c_int,
        __protocol: ::std::os::raw::c_int,
        __fds: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bind(
        __fd: ::std::os::raw::c_int,
        __addr: *const sockaddr,
        __len: socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getsockname(
        __fd: ::std::os::raw::c_int,
        __addr: *mut sockaddr,
        __len: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn connect(
        __fd: ::std::os::raw::c_int,
        __addr: *const sockaddr,
        __len: socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getpeername(
        __fd: ::std::os::raw::c_int,
        __addr: *mut sockaddr,
        __len: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn send(
        __fd: ::std::os::raw::c_int,
        __buf: *const ::std::os::raw::c_void,
        __n: usize,
        __flags: ::std::os::raw::c_int,
    ) -> isize;
}
extern "C" {
    pub fn recv(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_void,
        __n: usize,
        __flags: ::std::os::raw::c_int,
    ) -> isize;
}
extern "C" {
    pub fn sendto(
        __fd: ::std::os::raw::c_int,
        __buf: *const ::std::os::raw::c_void,
        __n: usize,
        __flags: ::std::os::raw::c_int,
        __addr: *const sockaddr,
        __addr_len: socklen_t,
    ) -> isize;
}
extern "C" {
    pub fn recvfrom(
        __fd: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_void,
        __n: usize,
        __flags: ::std::os::raw::c_int,
        __addr: *mut sockaddr,
        __addr_len: *mut socklen_t,
    ) -> isize;
}
extern "C" {
    pub fn sendmsg(
        __fd: ::std::os::raw::c_int,
        __message: *const msghdr,
        __flags: ::std::os::raw::c_int,
    ) -> isize;
}
extern "C" {
    pub fn recvmsg(
        __fd: ::std::os::raw::c_int,
        __message: *mut msghdr,
        __flags: ::std::os::raw::c_int,
    ) -> isize;
}
extern "C" {
    pub fn getsockopt(
        __fd: ::std::os::raw::c_int,
        __level: ::std::os::raw::c_int,
        __optname: ::std::os::raw::c_int,
        __optval: *mut ::std::os::raw::c_void,
        __optlen: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setsockopt(
        __fd: ::std::os::raw::c_int,
        __level: ::std::os::raw::c_int,
        __optname: ::std::os::raw::c_int,
        __optval: *const ::std::os::raw::c_void,
        __optlen: socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn listen(__fd: ::std::os::raw::c_int, __n: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn accept(
        __fd: ::std::os::raw::c_int,
        __addr: *mut sockaddr,
        __addr_len: *mut socklen_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn shutdown(
        __fd: ::std::os::raw::c_int,
        __how: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sockatmark(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn isfdtype(
        __fd: ::std::os::raw::c_int,
        __fdtype: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
pub type in_addr_t = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct in_addr {
    pub s_addr: in_addr_t,
}
#[test]
fn bindgen_test_layout_in_addr() {
    const UNINIT: ::std::mem::MaybeUninit<in_addr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<in_addr>(),
        4usize,
        concat!("Size of: ", stringify!(in_addr))
    );
    assert_eq!(
        ::std::mem::align_of::<in_addr>(),
        4usize,
        concat!("Alignment of ", stringify!(in_addr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s_addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in_addr),
            "::",
            stringify!(s_addr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_opts {
    pub ip_dst: in_addr,
    pub ip_opts: [::std::os::raw::c_char; 40usize],
}
#[test]
fn bindgen_test_layout_ip_opts() {
    const UNINIT: ::std::mem::MaybeUninit<ip_opts> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ip_opts>(),
        44usize,
        concat!("Size of: ", stringify!(ip_opts))
    );
    assert_eq!(
        ::std::mem::align_of::<ip_opts>(),
        4usize,
        concat!("Alignment of ", stringify!(ip_opts))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ip_dst) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_opts),
            "::",
            stringify!(ip_dst)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ip_opts) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_opts),
            "::",
            stringify!(ip_opts)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_mreqn {
    pub imr_multiaddr: in_addr,
    pub imr_address: in_addr,
    pub imr_ifindex: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_ip_mreqn() {
    const UNINIT: ::std::mem::MaybeUninit<ip_mreqn> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ip_mreqn>(),
        12usize,
        concat!("Size of: ", stringify!(ip_mreqn))
    );
    assert_eq!(
        ::std::mem::align_of::<ip_mreqn>(),
        4usize,
        concat!("Alignment of ", stringify!(ip_mreqn))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imr_multiaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreqn),
            "::",
            stringify!(imr_multiaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imr_address) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreqn),
            "::",
            stringify!(imr_address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imr_ifindex) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreqn),
            "::",
            stringify!(imr_ifindex)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct in_pktinfo {
    pub ipi_ifindex: ::std::os::raw::c_int,
    pub ipi_spec_dst: in_addr,
    pub ipi_addr: in_addr,
}
#[test]
fn bindgen_test_layout_in_pktinfo() {
    const UNINIT: ::std::mem::MaybeUninit<in_pktinfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<in_pktinfo>(),
        12usize,
        concat!("Size of: ", stringify!(in_pktinfo))
    );
    assert_eq!(
        ::std::mem::align_of::<in_pktinfo>(),
        4usize,
        concat!("Alignment of ", stringify!(in_pktinfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ipi_ifindex) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in_pktinfo),
            "::",
            stringify!(ipi_ifindex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ipi_spec_dst) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(in_pktinfo),
            "::",
            stringify!(ipi_spec_dst)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ipi_addr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(in_pktinfo),
            "::",
            stringify!(ipi_addr)
        )
    );
}
pub const IPPROTO_IP: _bindgen_ty_4 = 0;
pub const IPPROTO_ICMP: _bindgen_ty_4 = 1;
pub const IPPROTO_IGMP: _bindgen_ty_4 = 2;
pub const IPPROTO_IPIP: _bindgen_ty_4 = 4;
pub const IPPROTO_TCP: _bindgen_ty_4 = 6;
pub const IPPROTO_EGP: _bindgen_ty_4 = 8;
pub const IPPROTO_PUP: _bindgen_ty_4 = 12;
pub const IPPROTO_UDP: _bindgen_ty_4 = 17;
pub const IPPROTO_IDP: _bindgen_ty_4 = 22;
pub const IPPROTO_TP: _bindgen_ty_4 = 29;
pub const IPPROTO_DCCP: _bindgen_ty_4 = 33;
pub const IPPROTO_IPV6: _bindgen_ty_4 = 41;
pub const IPPROTO_RSVP: _bindgen_ty_4 = 46;
pub const IPPROTO_GRE: _bindgen_ty_4 = 47;
pub const IPPROTO_ESP: _bindgen_ty_4 = 50;
pub const IPPROTO_AH: _bindgen_ty_4 = 51;
pub const IPPROTO_MTP: _bindgen_ty_4 = 92;
pub const IPPROTO_BEETPH: _bindgen_ty_4 = 94;
pub const IPPROTO_ENCAP: _bindgen_ty_4 = 98;
pub const IPPROTO_PIM: _bindgen_ty_4 = 103;
pub const IPPROTO_COMP: _bindgen_ty_4 = 108;
pub const IPPROTO_SCTP: _bindgen_ty_4 = 132;
pub const IPPROTO_UDPLITE: _bindgen_ty_4 = 136;
pub const IPPROTO_MPLS: _bindgen_ty_4 = 137;
pub const IPPROTO_RAW: _bindgen_ty_4 = 255;
pub const IPPROTO_MAX: _bindgen_ty_4 = 256;
pub type _bindgen_ty_4 = ::std::os::raw::c_uint;
pub const IPPROTO_HOPOPTS: _bindgen_ty_5 = 0;
pub const IPPROTO_ROUTING: _bindgen_ty_5 = 43;
pub const IPPROTO_FRAGMENT: _bindgen_ty_5 = 44;
pub const IPPROTO_ICMPV6: _bindgen_ty_5 = 58;
pub const IPPROTO_NONE: _bindgen_ty_5 = 59;
pub const IPPROTO_DSTOPTS: _bindgen_ty_5 = 60;
pub const IPPROTO_MH: _bindgen_ty_5 = 135;
pub type _bindgen_ty_5 = ::std::os::raw::c_uint;
pub type in_port_t = u16;
pub const IPPORT_ECHO: _bindgen_ty_6 = 7;
pub const IPPORT_DISCARD: _bindgen_ty_6 = 9;
pub const IPPORT_SYSTAT: _bindgen_ty_6 = 11;
pub const IPPORT_DAYTIME: _bindgen_ty_6 = 13;
pub const IPPORT_NETSTAT: _bindgen_ty_6 = 15;
pub const IPPORT_FTP: _bindgen_ty_6 = 21;
pub const IPPORT_TELNET: _bindgen_ty_6 = 23;
pub const IPPORT_SMTP: _bindgen_ty_6 = 25;
pub const IPPORT_TIMESERVER: _bindgen_ty_6 = 37;
pub const IPPORT_NAMESERVER: _bindgen_ty_6 = 42;
pub const IPPORT_WHOIS: _bindgen_ty_6 = 43;
pub const IPPORT_MTP: _bindgen_ty_6 = 57;
pub const IPPORT_TFTP: _bindgen_ty_6 = 69;
pub const IPPORT_RJE: _bindgen_ty_6 = 77;
pub const IPPORT_FINGER: _bindgen_ty_6 = 79;
pub const IPPORT_TTYLINK: _bindgen_ty_6 = 87;
pub const IPPORT_SUPDUP: _bindgen_ty_6 = 95;
pub const IPPORT_EXECSERVER: _bindgen_ty_6 = 512;
pub const IPPORT_LOGINSERVER: _bindgen_ty_6 = 513;
pub const IPPORT_CMDSERVER: _bindgen_ty_6 = 514;
pub const IPPORT_EFSSERVER: _bindgen_ty_6 = 520;
pub const IPPORT_BIFFUDP: _bindgen_ty_6 = 512;
pub const IPPORT_WHOSERVER: _bindgen_ty_6 = 513;
pub const IPPORT_ROUTESERVER: _bindgen_ty_6 = 520;
pub const IPPORT_RESERVED: _bindgen_ty_6 = 1024;
pub const IPPORT_USERRESERVED: _bindgen_ty_6 = 5000;
pub type _bindgen_ty_6 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct in6_addr {
    pub __in6_u: in6_addr__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union in6_addr__bindgen_ty_1 {
    pub __u6_addr8: [u8; 16usize],
    pub __u6_addr16: [u16; 8usize],
    pub __u6_addr32: [u32; 4usize],
}
#[test]
fn bindgen_test_layout_in6_addr__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<in6_addr__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<in6_addr__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(in6_addr__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<in6_addr__bindgen_ty_1>(),
        4usize,
        concat!("Alignment of ", stringify!(in6_addr__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__u6_addr8) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr__bindgen_ty_1),
            "::",
            stringify!(__u6_addr8)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__u6_addr16) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr__bindgen_ty_1),
            "::",
            stringify!(__u6_addr16)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__u6_addr32) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr__bindgen_ty_1),
            "::",
            stringify!(__u6_addr32)
        )
    );
}
#[test]
fn bindgen_test_layout_in6_addr() {
    const UNINIT: ::std::mem::MaybeUninit<in6_addr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<in6_addr>(),
        16usize,
        concat!("Size of: ", stringify!(in6_addr))
    );
    assert_eq!(
        ::std::mem::align_of::<in6_addr>(),
        4usize,
        concat!("Alignment of ", stringify!(in6_addr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__in6_u) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(in6_addr),
            "::",
            stringify!(__in6_u)
        )
    );
}
extern "C" {
    pub static in6addr_any: in6_addr;
}
extern "C" {
    pub static in6addr_loopback: in6_addr;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sockaddr_in {
    pub sin_family: sa_family_t,
    pub sin_port: in_port_t,
    pub sin_addr: in_addr,
    pub sin_zero: [::std::os::raw::c_uchar; 8usize],
}
#[test]
fn bindgen_test_layout_sockaddr_in() {
    const UNINIT: ::std::mem::MaybeUninit<sockaddr_in> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sockaddr_in>(),
        16usize,
        concat!("Size of: ", stringify!(sockaddr_in))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr_in>(),
        4usize,
        concat!("Alignment of ", stringify!(sockaddr_in))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin_family) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in),
            "::",
            stringify!(sin_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin_port) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in),
            "::",
            stringify!(sin_port)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin_addr) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in),
            "::",
            stringify!(sin_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin_zero) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in),
            "::",
            stringify!(sin_zero)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sockaddr_in6 {
    pub sin6_family: sa_family_t,
    pub sin6_port: in_port_t,
    pub sin6_flowinfo: u32,
    pub sin6_addr: in6_addr,
    pub sin6_scope_id: u32,
}
#[test]
fn bindgen_test_layout_sockaddr_in6() {
    const UNINIT: ::std::mem::MaybeUninit<sockaddr_in6> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sockaddr_in6>(),
        28usize,
        concat!("Size of: ", stringify!(sockaddr_in6))
    );
    assert_eq!(
        ::std::mem::align_of::<sockaddr_in6>(),
        4usize,
        concat!("Alignment of ", stringify!(sockaddr_in6))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin6_family) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_family)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin6_port) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_port)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin6_flowinfo) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_flowinfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin6_addr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sin6_scope_id) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(sockaddr_in6),
            "::",
            stringify!(sin6_scope_id)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_mreq {
    pub imr_multiaddr: in_addr,
    pub imr_interface: in_addr,
}
#[test]
fn bindgen_test_layout_ip_mreq() {
    const UNINIT: ::std::mem::MaybeUninit<ip_mreq> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ip_mreq>(),
        8usize,
        concat!("Size of: ", stringify!(ip_mreq))
    );
    assert_eq!(
        ::std::mem::align_of::<ip_mreq>(),
        4usize,
        concat!("Alignment of ", stringify!(ip_mreq))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imr_multiaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreq),
            "::",
            stringify!(imr_multiaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imr_interface) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreq),
            "::",
            stringify!(imr_interface)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_mreq_source {
    pub imr_multiaddr: in_addr,
    pub imr_interface: in_addr,
    pub imr_sourceaddr: in_addr,
}
#[test]
fn bindgen_test_layout_ip_mreq_source() {
    const UNINIT: ::std::mem::MaybeUninit<ip_mreq_source> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ip_mreq_source>(),
        12usize,
        concat!("Size of: ", stringify!(ip_mreq_source))
    );
    assert_eq!(
        ::std::mem::align_of::<ip_mreq_source>(),
        4usize,
        concat!("Alignment of ", stringify!(ip_mreq_source))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imr_multiaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreq_source),
            "::",
            stringify!(imr_multiaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imr_interface) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreq_source),
            "::",
            stringify!(imr_interface)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imr_sourceaddr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_mreq_source),
            "::",
            stringify!(imr_sourceaddr)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ipv6_mreq {
    pub ipv6mr_multiaddr: in6_addr,
    pub ipv6mr_interface: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_ipv6_mreq() {
    const UNINIT: ::std::mem::MaybeUninit<ipv6_mreq> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ipv6_mreq>(),
        20usize,
        concat!("Size of: ", stringify!(ipv6_mreq))
    );
    assert_eq!(
        ::std::mem::align_of::<ipv6_mreq>(),
        4usize,
        concat!("Alignment of ", stringify!(ipv6_mreq))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ipv6mr_multiaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ipv6_mreq),
            "::",
            stringify!(ipv6mr_multiaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ipv6mr_interface) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ipv6_mreq),
            "::",
            stringify!(ipv6mr_interface)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct group_req {
    pub gr_interface: u32,
    pub gr_group: sockaddr_storage,
}
#[test]
fn bindgen_test_layout_group_req() {
    const UNINIT: ::std::mem::MaybeUninit<group_req> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<group_req>(),
        132usize,
        concat!("Size of: ", stringify!(group_req))
    );
    assert_eq!(
        ::std::mem::align_of::<group_req>(),
        4usize,
        concat!("Alignment of ", stringify!(group_req))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gr_interface) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(group_req),
            "::",
            stringify!(gr_interface)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gr_group) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(group_req),
            "::",
            stringify!(gr_group)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct group_source_req {
    pub gsr_interface: u32,
    pub gsr_group: sockaddr_storage,
    pub gsr_source: sockaddr_storage,
}
#[test]
fn bindgen_test_layout_group_source_req() {
    const UNINIT: ::std::mem::MaybeUninit<group_source_req> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<group_source_req>(),
        260usize,
        concat!("Size of: ", stringify!(group_source_req))
    );
    assert_eq!(
        ::std::mem::align_of::<group_source_req>(),
        4usize,
        concat!("Alignment of ", stringify!(group_source_req))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gsr_interface) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(group_source_req),
            "::",
            stringify!(gsr_interface)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gsr_group) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(group_source_req),
            "::",
            stringify!(gsr_group)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gsr_source) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(group_source_req),
            "::",
            stringify!(gsr_source)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ip_msfilter {
    pub imsf_multiaddr: in_addr,
    pub imsf_interface: in_addr,
    pub imsf_fmode: u32,
    pub imsf_numsrc: u32,
    pub imsf_slist: [in_addr; 1usize],
}
#[test]
fn bindgen_test_layout_ip_msfilter() {
    const UNINIT: ::std::mem::MaybeUninit<ip_msfilter> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<ip_msfilter>(),
        20usize,
        concat!("Size of: ", stringify!(ip_msfilter))
    );
    assert_eq!(
        ::std::mem::align_of::<ip_msfilter>(),
        4usize,
        concat!("Alignment of ", stringify!(ip_msfilter))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imsf_multiaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_msfilter),
            "::",
            stringify!(imsf_multiaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imsf_interface) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_msfilter),
            "::",
            stringify!(imsf_interface)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imsf_fmode) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_msfilter),
            "::",
            stringify!(imsf_fmode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imsf_numsrc) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_msfilter),
            "::",
            stringify!(imsf_numsrc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imsf_slist) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ip_msfilter),
            "::",
            stringify!(imsf_slist)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct group_filter {
    pub gf_interface: u32,
    pub gf_group: sockaddr_storage,
    pub gf_fmode: u32,
    pub gf_numsrc: u32,
    pub gf_slist: [sockaddr_storage; 1usize],
}
#[test]
fn bindgen_test_layout_group_filter() {
    const UNINIT: ::std::mem::MaybeUninit<group_filter> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<group_filter>(),
        268usize,
        concat!("Size of: ", stringify!(group_filter))
    );
    assert_eq!(
        ::std::mem::align_of::<group_filter>(),
        4usize,
        concat!("Alignment of ", stringify!(group_filter))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gf_interface) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(group_filter),
            "::",
            stringify!(gf_interface)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gf_group) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(group_filter),
            "::",
            stringify!(gf_group)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gf_fmode) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(group_filter),
            "::",
            stringify!(gf_fmode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gf_numsrc) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(group_filter),
            "::",
            stringify!(gf_numsrc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gf_slist) as usize - ptr as usize },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(group_filter),
            "::",
            stringify!(gf_slist)
        )
    );
}
extern "C" {
    pub fn ntohl(__netlong: u32) -> u32;
}
extern "C" {
    pub fn ntohs(__netshort: u16) -> u16;
}
extern "C" {
    pub fn htonl(__hostlong: u32) -> u32;
}
extern "C" {
    pub fn htons(__hostshort: u16) -> u16;
}
extern "C" {
    pub fn bindresvport(
        __sockfd: ::std::os::raw::c_int,
        __sock_in: *mut sockaddr_in,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bindresvport6(
        __sockfd: ::std::os::raw::c_int,
        __sock_in: *mut sockaddr_in6,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bt_security {
    pub level: u8,
    pub key_size: u8,
}
#[test]
fn bindgen_test_layout_bt_security() {
    const UNINIT: ::std::mem::MaybeUninit<bt_security> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bt_security>(),
        2usize,
        concat!("Size of: ", stringify!(bt_security))
    );
    assert_eq!(
        ::std::mem::align_of::<bt_security>(),
        1usize,
        concat!("Alignment of ", stringify!(bt_security))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).level) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bt_security),
            "::",
            stringify!(level)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key_size) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bt_security),
            "::",
            stringify!(key_size)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bt_power {
    pub force_active: u8,
}
#[test]
fn bindgen_test_layout_bt_power() {
    const UNINIT: ::std::mem::MaybeUninit<bt_power> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bt_power>(),
        1usize,
        concat!("Size of: ", stringify!(bt_power))
    );
    assert_eq!(
        ::std::mem::align_of::<bt_power>(),
        1usize,
        concat!("Alignment of ", stringify!(bt_power))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).force_active) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bt_power),
            "::",
            stringify!(force_active)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bt_voice {
    pub setting: u16,
}
#[test]
fn bindgen_test_layout_bt_voice() {
    const UNINIT: ::std::mem::MaybeUninit<bt_voice> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bt_voice>(),
        2usize,
        concat!("Size of: ", stringify!(bt_voice))
    );
    assert_eq!(
        ::std::mem::align_of::<bt_voice>(),
        2usize,
        concat!("Alignment of ", stringify!(bt_voice))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).setting) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bt_voice),
            "::",
            stringify!(setting)
        )
    );
}
pub const BT_CONNECTED: _bindgen_ty_7 = 1;
pub const BT_OPEN: _bindgen_ty_7 = 2;
pub const BT_BOUND: _bindgen_ty_7 = 3;
pub const BT_LISTEN: _bindgen_ty_7 = 4;
pub const BT_CONNECT: _bindgen_ty_7 = 5;
pub const BT_CONNECT2: _bindgen_ty_7 = 6;
pub const BT_CONFIG: _bindgen_ty_7 = 7;
pub const BT_DISCONN: _bindgen_ty_7 = 8;
pub const BT_CLOSED: _bindgen_ty_7 = 9;
pub type _bindgen_ty_7 = ::std::os::raw::c_uint;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct bdaddr_t {
    pub b: [u8; 6usize],
}
#[test]
fn bindgen_test_layout_bdaddr_t() {
    const UNINIT: ::std::mem::MaybeUninit<bdaddr_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bdaddr_t>(),
        6usize,
        concat!("Size of: ", stringify!(bdaddr_t))
    );
    assert_eq!(
        ::std::mem::align_of::<bdaddr_t>(),
        1usize,
        concat!("Alignment of ", stringify!(bdaddr_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bdaddr_t),
            "::",
            stringify!(b)
        )
    );
}
extern "C" {
    pub fn baswap(dst: *mut bdaddr_t, src: *const bdaddr_t);
}
extern "C" {
    pub fn strtoba(str_: *const ::std::os::raw::c_char) -> *mut bdaddr_t;
}
extern "C" {
    pub fn batostr(ba: *const bdaddr_t) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ba2str(ba: *const bdaddr_t, str_: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn str2ba(str_: *const ::std::os::raw::c_char, ba: *mut bdaddr_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ba2oui(ba: *const bdaddr_t, oui: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bachk(str_: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn baprintf(format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bafprintf(
        stream: *mut FILE,
        format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn basprintf(
        str_: *mut ::std::os::raw::c_char,
        format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn basnprintf(
        str_: *mut ::std::os::raw::c_char,
        size: usize,
        format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bt_malloc(size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn bt_free(ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn bt_error(code: u16) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bt_compidtostr(id: ::std::os::raw::c_int) -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uint128_t {
    pub data: [u8; 16usize],
}
#[test]
fn bindgen_test_layout_uint128_t() {
    const UNINIT: ::std::mem::MaybeUninit<uint128_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<uint128_t>(),
        16usize,
        concat!("Size of: ", stringify!(uint128_t))
    );
    assert_eq!(
        ::std::mem::align_of::<uint128_t>(),
        1usize,
        concat!("Alignment of ", stringify!(uint128_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(uint128_t),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C, packed)]
pub struct bnep_setup_conn_req {
    pub type_: u8,
    pub ctrl: u8,
    pub uuid_size: u8,
    pub service: __IncompleteArrayField<u8>,
}
#[test]
fn bindgen_test_layout_bnep_setup_conn_req() {
    const UNINIT: ::std::mem::MaybeUninit<bnep_setup_conn_req> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bnep_setup_conn_req>(),
        3usize,
        concat!("Size of: ", stringify!(bnep_setup_conn_req))
    );
    assert_eq!(
        ::std::mem::align_of::<bnep_setup_conn_req>(),
        1usize,
        concat!("Alignment of ", stringify!(bnep_setup_conn_req))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bnep_setup_conn_req),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ctrl) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bnep_setup_conn_req),
            "::",
            stringify!(ctrl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uuid_size) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bnep_setup_conn_req),
            "::",
            stringify!(uuid_size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).service) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(bnep_setup_conn_req),
            "::",
            stringify!(service)
        )
    );
}
#[repr(C, packed)]
pub struct bnep_set_filter_req {
    pub type_: u8,
    pub ctrl: u8,
    pub len: u16,
    pub list: __IncompleteArrayField<u8>,
}
#[test]
fn bindgen_test_layout_bnep_set_filter_req() {
    const UNINIT: ::std::mem::MaybeUninit<bnep_set_filter_req> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bnep_set_filter_req>(),
        4usize,
        concat!("Size of: ", stringify!(bnep_set_filter_req))
    );
    assert_eq!(
        ::std::mem::align_of::<bnep_set_filter_req>(),
        1usize,
        concat!("Alignment of ", stringify!(bnep_set_filter_req))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bnep_set_filter_req),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ctrl) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bnep_set_filter_req),
            "::",
            stringify!(ctrl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bnep_set_filter_req),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).list) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bnep_set_filter_req),
            "::",
            stringify!(list)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct bnep_ctrl_cmd_not_understood_cmd {
    pub type_: u8,
    pub ctrl: u8,
    pub unkn_ctrl: u8,
}
#[test]
fn bindgen_test_layout_bnep_ctrl_cmd_not_understood_cmd() {
    const UNINIT: ::std::mem::MaybeUninit<bnep_ctrl_cmd_not_understood_cmd> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bnep_ctrl_cmd_not_understood_cmd>(),
        3usize,
        concat!("Size of: ", stringify!(bnep_ctrl_cmd_not_understood_cmd))
    );
    assert_eq!(
        ::std::mem::align_of::<bnep_ctrl_cmd_not_understood_cmd>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(bnep_ctrl_cmd_not_understood_cmd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bnep_ctrl_cmd_not_understood_cmd),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ctrl) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bnep_ctrl_cmd_not_understood_cmd),
            "::",
            stringify!(ctrl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).unkn_ctrl) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bnep_ctrl_cmd_not_understood_cmd),
            "::",
            stringify!(unkn_ctrl)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct bnep_control_rsp {
    pub type_: u8,
    pub ctrl: u8,
    pub resp: u16,
}
#[test]
fn bindgen_test_layout_bnep_control_rsp() {
    const UNINIT: ::std::mem::MaybeUninit<bnep_control_rsp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bnep_control_rsp>(),
        4usize,
        concat!("Size of: ", stringify!(bnep_control_rsp))
    );
    assert_eq!(
        ::std::mem::align_of::<bnep_control_rsp>(),
        1usize,
        concat!("Alignment of ", stringify!(bnep_control_rsp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bnep_control_rsp),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ctrl) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bnep_control_rsp),
            "::",
            stringify!(ctrl)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).resp) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bnep_control_rsp),
            "::",
            stringify!(resp)
        )
    );
}
#[repr(C, packed)]
pub struct bnep_ext_hdr {
    pub type_: u8,
    pub len: u8,
    pub data: __IncompleteArrayField<u8>,
}
#[test]
fn bindgen_test_layout_bnep_ext_hdr() {
    const UNINIT: ::std::mem::MaybeUninit<bnep_ext_hdr> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bnep_ext_hdr>(),
        2usize,
        concat!("Size of: ", stringify!(bnep_ext_hdr))
    );
    assert_eq!(
        ::std::mem::align_of::<bnep_ext_hdr>(),
        1usize,
        concat!("Alignment of ", stringify!(bnep_ext_hdr))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bnep_ext_hdr),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).len) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(bnep_ext_hdr),
            "::",
            stringify!(len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(bnep_ext_hdr),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bnep_connadd_req {
    pub sock: ::std::os::raw::c_int,
    pub flags: u32,
    pub role: u16,
    pub device: [::std::os::raw::c_char; 16usize],
}
#[test]
fn bindgen_test_layout_bnep_connadd_req() {
    const UNINIT: ::std::mem::MaybeUninit<bnep_connadd_req> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bnep_connadd_req>(),
        28usize,
        concat!("Size of: ", stringify!(bnep_connadd_req))
    );
    assert_eq!(
        ::std::mem::align_of::<bnep_connadd_req>(),
        4usize,
        concat!("Alignment of ", stringify!(bnep_connadd_req))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sock) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bnep_connadd_req),
            "::",
            stringify!(sock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bnep_connadd_req),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).role) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bnep_connadd_req),
            "::",
            stringify!(role)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).device) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(bnep_connadd_req),
            "::",
            stringify!(device)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bnep_conndel_req {
    pub flags: u32,
    pub dst: [u8; 6usize],
}
#[test]
fn bindgen_test_layout_bnep_conndel_req() {
    const UNINIT: ::std::mem::MaybeUninit<bnep_conndel_req> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bnep_conndel_req>(),
        12usize,
        concat!("Size of: ", stringify!(bnep_conndel_req))
    );
    assert_eq!(
        ::std::mem::align_of::<bnep_conndel_req>(),
        4usize,
        concat!("Alignment of ", stringify!(bnep_conndel_req))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bnep_conndel_req),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dst) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bnep_conndel_req),
            "::",
            stringify!(dst)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bnep_conninfo {
    pub flags: u32,
    pub role: u16,
    pub state: u16,
    pub dst: [u8; 6usize],
    pub device: [::std::os::raw::c_char; 16usize],
}
#[test]
fn bindgen_test_layout_bnep_conninfo() {
    const UNINIT: ::std::mem::MaybeUninit<bnep_conninfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bnep_conninfo>(),
        32usize,
        concat!("Size of: ", stringify!(bnep_conninfo))
    );
    assert_eq!(
        ::std::mem::align_of::<bnep_conninfo>(),
        4usize,
        concat!("Alignment of ", stringify!(bnep_conninfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bnep_conninfo),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).role) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bnep_conninfo),
            "::",
            stringify!(role)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(bnep_conninfo),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dst) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(bnep_conninfo),
            "::",
            stringify!(dst)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).device) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(bnep_conninfo),
            "::",
            stringify!(device)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct bnep_connlist_req {
    pub cnum: u32,
    pub ci: *mut bnep_conninfo,
}
#[test]
fn bindgen_test_layout_bnep_connlist_req() {
    const UNINIT: ::std::mem::MaybeUninit<bnep_connlist_req> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<bnep_connlist_req>(),
        8usize,
        concat!("Size of: ", stringify!(bnep_connlist_req))
    );
    assert_eq!(
        ::std::mem::align_of::<bnep_connlist_req>(),
        4usize,
        concat!("Alignment of ", stringify!(bnep_connlist_req))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cnum) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(bnep_connlist_req),
            "::",
            stringify!(cnum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ci) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(bnep_connlist_req),
            "::",
            stringify!(ci)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cmtp_connadd_req {
    pub sock: ::std::os::raw::c_int,
    pub flags: u32,
}
#[test]
fn bindgen_test_layout_cmtp_connadd_req() {
    const UNINIT: ::std::mem::MaybeUninit<cmtp_connadd_req> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cmtp_connadd_req>(),
        8usize,
        concat!("Size of: ", stringify!(cmtp_connadd_req))
    );
    assert_eq!(
        ::std::mem::align_of::<cmtp_connadd_req>(),
        4usize,
        concat!("Alignment of ", stringify!(cmtp_connadd_req))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sock) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cmtp_connadd_req),
            "::",
            stringify!(sock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(cmtp_connadd_req),
            "::",
            stringify!(flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cmtp_conndel_req {
    pub bdaddr: bdaddr_t,
    pub flags: u32,
}
#[test]
fn bindgen_test_layout_cmtp_conndel_req() {
    const UNINIT: ::std::mem::MaybeUninit<cmtp_conndel_req> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cmtp_conndel_req>(),
        12usize,
        concat!("Size of: ", stringify!(cmtp_conndel_req))
    );
    assert_eq!(
        ::std::mem::align_of::<cmtp_conndel_req>(),
        4usize,
        concat!("Alignment of ", stringify!(cmtp_conndel_req))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bdaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cmtp_conndel_req),
            "::",
            stringify!(bdaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cmtp_conndel_req),
            "::",
            stringify!(flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cmtp_conninfo {
    pub bdaddr: bdaddr_t,
    pub flags: u32,
    pub state: u16,
    pub num: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_cmtp_conninfo() {
    const UNINIT: ::std::mem::MaybeUninit<cmtp_conninfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cmtp_conninfo>(),
        20usize,
        concat!("Size of: ", stringify!(cmtp_conninfo))
    );
    assert_eq!(
        ::std::mem::align_of::<cmtp_conninfo>(),
        4usize,
        concat!("Alignment of ", stringify!(cmtp_conninfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bdaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cmtp_conninfo),
            "::",
            stringify!(bdaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(cmtp_conninfo),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(cmtp_conninfo),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(cmtp_conninfo),
            "::",
            stringify!(num)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct cmtp_connlist_req {
    pub cnum: u32,
    pub ci: *mut cmtp_conninfo,
}
#[test]
fn bindgen_test_layout_cmtp_connlist_req() {
    const UNINIT: ::std::mem::MaybeUninit<cmtp_connlist_req> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cmtp_connlist_req>(),
        8usize,
        concat!("Size of: ", stringify!(cmtp_connlist_req))
    );
    assert_eq!(
        ::std::mem::align_of::<cmtp_connlist_req>(),
        4usize,
        concat!("Alignment of ", stringify!(cmtp_connlist_req))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cnum) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cmtp_connlist_req),
            "::",
            stringify!(cnum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ci) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(cmtp_connlist_req),
            "::",
            stringify!(ci)
        )
    );
}
pub const HCI_UP: _bindgen_ty_8 = 0;
pub const HCI_INIT: _bindgen_ty_8 = 1;
pub const HCI_RUNNING: _bindgen_ty_8 = 2;
pub const HCI_PSCAN: _bindgen_ty_8 = 3;
pub const HCI_ISCAN: _bindgen_ty_8 = 4;
pub const HCI_AUTH: _bindgen_ty_8 = 5;
pub const HCI_ENCRYPT: _bindgen_ty_8 = 6;
pub const HCI_INQUIRY: _bindgen_ty_8 = 7;
pub const HCI_RAW: _bindgen_ty_8 = 8;
pub type _bindgen_ty_8 = ::std::os::raw::c_uint;
pub const LE_PUBLIC_ADDRESS: _bindgen_ty_9 = 0;
pub const LE_RANDOM_ADDRESS: _bindgen_ty_9 = 1;
pub type _bindgen_ty_9 = ::std::os::raw::c_uint;
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct inquiry_cp {
    pub lap: [u8; 3usize],
    pub length: u8,
    pub num_rsp: u8,
}
#[test]
fn bindgen_test_layout_inquiry_cp() {
    const UNINIT: ::std::mem::MaybeUninit<inquiry_cp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<inquiry_cp>(),
        5usize,
        concat!("Size of: ", stringify!(inquiry_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<inquiry_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(inquiry_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lap) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(inquiry_cp),
            "::",
            stringify!(lap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(inquiry_cp),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_rsp) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(inquiry_cp),
            "::",
            stringify!(num_rsp)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct status_bdaddr_rp {
    pub status: u8,
    pub bdaddr: bdaddr_t,
}
#[test]
fn bindgen_test_layout_status_bdaddr_rp() {
    const UNINIT: ::std::mem::MaybeUninit<status_bdaddr_rp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<status_bdaddr_rp>(),
        7usize,
        concat!("Size of: ", stringify!(status_bdaddr_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<status_bdaddr_rp>(),
        1usize,
        concat!("Alignment of ", stringify!(status_bdaddr_rp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(status_bdaddr_rp),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bdaddr) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(status_bdaddr_rp),
            "::",
            stringify!(bdaddr)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct periodic_inquiry_cp {
    pub max_period: u16,
    pub min_period: u16,
    pub lap: [u8; 3usize],
    pub length: u8,
    pub num_rsp: u8,
}
#[test]
fn bindgen_test_layout_periodic_inquiry_cp() {
    const UNINIT: ::std::mem::MaybeUninit<periodic_inquiry_cp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<periodic_inquiry_cp>(),
        9usize,
        concat!("Size of: ", stringify!(periodic_inquiry_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<periodic_inquiry_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(periodic_inquiry_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_period) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(periodic_inquiry_cp),
            "::",
            stringify!(max_period)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_period) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(periodic_inquiry_cp),
            "::",
            stringify!(min_period)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lap) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(periodic_inquiry_cp),
            "::",
            stringify!(lap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(periodic_inquiry_cp),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_rsp) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(periodic_inquiry_cp),
            "::",
            stringify!(num_rsp)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct create_conn_cp {
    pub bdaddr: bdaddr_t,
    pub pkt_type: u16,
    pub pscan_rep_mode: u8,
    pub pscan_mode: u8,
    pub clock_offset: u16,
    pub role_switch: u8,
}
#[test]
fn bindgen_test_layout_create_conn_cp() {
    const UNINIT: ::std::mem::MaybeUninit<create_conn_cp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<create_conn_cp>(),
        13usize,
        concat!("Size of: ", stringify!(create_conn_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<create_conn_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(create_conn_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bdaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(create_conn_cp),
            "::",
            stringify!(bdaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pkt_type) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(create_conn_cp),
            "::",
            stringify!(pkt_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pscan_rep_mode) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(create_conn_cp),
            "::",
            stringify!(pscan_rep_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pscan_mode) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(create_conn_cp),
            "::",
            stringify!(pscan_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clock_offset) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(create_conn_cp),
            "::",
            stringify!(clock_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).role_switch) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(create_conn_cp),
            "::",
            stringify!(role_switch)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct disconnect_cp {
    pub handle: u16,
    pub reason: u8,
}
#[test]
fn bindgen_test_layout_disconnect_cp() {
    const UNINIT: ::std::mem::MaybeUninit<disconnect_cp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<disconnect_cp>(),
        3usize,
        concat!("Size of: ", stringify!(disconnect_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<disconnect_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(disconnect_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(disconnect_cp),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reason) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(disconnect_cp),
            "::",
            stringify!(reason)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct add_sco_cp {
    pub handle: u16,
    pub pkt_type: u16,
}
#[test]
fn bindgen_test_layout_add_sco_cp() {
    const UNINIT: ::std::mem::MaybeUninit<add_sco_cp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<add_sco_cp>(),
        4usize,
        concat!("Size of: ", stringify!(add_sco_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<add_sco_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(add_sco_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(add_sco_cp),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pkt_type) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(add_sco_cp),
            "::",
            stringify!(pkt_type)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct create_conn_cancel_cp {
    pub bdaddr: bdaddr_t,
}
#[test]
fn bindgen_test_layout_create_conn_cancel_cp() {
    const UNINIT: ::std::mem::MaybeUninit<create_conn_cancel_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<create_conn_cancel_cp>(),
        6usize,
        concat!("Size of: ", stringify!(create_conn_cancel_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<create_conn_cancel_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(create_conn_cancel_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bdaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(create_conn_cancel_cp),
            "::",
            stringify!(bdaddr)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct accept_conn_req_cp {
    pub bdaddr: bdaddr_t,
    pub role: u8,
}
#[test]
fn bindgen_test_layout_accept_conn_req_cp() {
    const UNINIT: ::std::mem::MaybeUninit<accept_conn_req_cp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<accept_conn_req_cp>(),
        7usize,
        concat!("Size of: ", stringify!(accept_conn_req_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<accept_conn_req_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(accept_conn_req_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bdaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(accept_conn_req_cp),
            "::",
            stringify!(bdaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).role) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(accept_conn_req_cp),
            "::",
            stringify!(role)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct reject_conn_req_cp {
    pub bdaddr: bdaddr_t,
    pub reason: u8,
}
#[test]
fn bindgen_test_layout_reject_conn_req_cp() {
    const UNINIT: ::std::mem::MaybeUninit<reject_conn_req_cp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<reject_conn_req_cp>(),
        7usize,
        concat!("Size of: ", stringify!(reject_conn_req_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<reject_conn_req_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(reject_conn_req_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bdaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(reject_conn_req_cp),
            "::",
            stringify!(bdaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reason) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(reject_conn_req_cp),
            "::",
            stringify!(reason)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct link_key_reply_cp {
    pub bdaddr: bdaddr_t,
    pub link_key: [u8; 16usize],
}
#[test]
fn bindgen_test_layout_link_key_reply_cp() {
    const UNINIT: ::std::mem::MaybeUninit<link_key_reply_cp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<link_key_reply_cp>(),
        22usize,
        concat!("Size of: ", stringify!(link_key_reply_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<link_key_reply_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(link_key_reply_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bdaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(link_key_reply_cp),
            "::",
            stringify!(bdaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).link_key) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(link_key_reply_cp),
            "::",
            stringify!(link_key)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct pin_code_reply_cp {
    pub bdaddr: bdaddr_t,
    pub pin_len: u8,
    pub pin_code: [u8; 16usize],
}
#[test]
fn bindgen_test_layout_pin_code_reply_cp() {
    const UNINIT: ::std::mem::MaybeUninit<pin_code_reply_cp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<pin_code_reply_cp>(),
        23usize,
        concat!("Size of: ", stringify!(pin_code_reply_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<pin_code_reply_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(pin_code_reply_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bdaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(pin_code_reply_cp),
            "::",
            stringify!(bdaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pin_len) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(pin_code_reply_cp),
            "::",
            stringify!(pin_len)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pin_code) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(pin_code_reply_cp),
            "::",
            stringify!(pin_code)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct set_conn_ptype_cp {
    pub handle: u16,
    pub pkt_type: u16,
}
#[test]
fn bindgen_test_layout_set_conn_ptype_cp() {
    const UNINIT: ::std::mem::MaybeUninit<set_conn_ptype_cp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<set_conn_ptype_cp>(),
        4usize,
        concat!("Size of: ", stringify!(set_conn_ptype_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<set_conn_ptype_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(set_conn_ptype_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(set_conn_ptype_cp),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pkt_type) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(set_conn_ptype_cp),
            "::",
            stringify!(pkt_type)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct auth_requested_cp {
    pub handle: u16,
}
#[test]
fn bindgen_test_layout_auth_requested_cp() {
    const UNINIT: ::std::mem::MaybeUninit<auth_requested_cp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<auth_requested_cp>(),
        2usize,
        concat!("Size of: ", stringify!(auth_requested_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<auth_requested_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(auth_requested_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(auth_requested_cp),
            "::",
            stringify!(handle)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct set_conn_encrypt_cp {
    pub handle: u16,
    pub encrypt: u8,
}
#[test]
fn bindgen_test_layout_set_conn_encrypt_cp() {
    const UNINIT: ::std::mem::MaybeUninit<set_conn_encrypt_cp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<set_conn_encrypt_cp>(),
        3usize,
        concat!("Size of: ", stringify!(set_conn_encrypt_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<set_conn_encrypt_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(set_conn_encrypt_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(set_conn_encrypt_cp),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).encrypt) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(set_conn_encrypt_cp),
            "::",
            stringify!(encrypt)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct change_conn_link_key_cp {
    pub handle: u16,
}
#[test]
fn bindgen_test_layout_change_conn_link_key_cp() {
    const UNINIT: ::std::mem::MaybeUninit<change_conn_link_key_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<change_conn_link_key_cp>(),
        2usize,
        concat!("Size of: ", stringify!(change_conn_link_key_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<change_conn_link_key_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(change_conn_link_key_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(change_conn_link_key_cp),
            "::",
            stringify!(handle)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct master_link_key_cp {
    pub key_flag: u8,
}
#[test]
fn bindgen_test_layout_master_link_key_cp() {
    const UNINIT: ::std::mem::MaybeUninit<master_link_key_cp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<master_link_key_cp>(),
        1usize,
        concat!("Size of: ", stringify!(master_link_key_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<master_link_key_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(master_link_key_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key_flag) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(master_link_key_cp),
            "::",
            stringify!(key_flag)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct remote_name_req_cp {
    pub bdaddr: bdaddr_t,
    pub pscan_rep_mode: u8,
    pub pscan_mode: u8,
    pub clock_offset: u16,
}
#[test]
fn bindgen_test_layout_remote_name_req_cp() {
    const UNINIT: ::std::mem::MaybeUninit<remote_name_req_cp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<remote_name_req_cp>(),
        10usize,
        concat!("Size of: ", stringify!(remote_name_req_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<remote_name_req_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(remote_name_req_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bdaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(remote_name_req_cp),
            "::",
            stringify!(bdaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pscan_rep_mode) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(remote_name_req_cp),
            "::",
            stringify!(pscan_rep_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pscan_mode) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(remote_name_req_cp),
            "::",
            stringify!(pscan_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clock_offset) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(remote_name_req_cp),
            "::",
            stringify!(clock_offset)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct remote_name_req_cancel_cp {
    pub bdaddr: bdaddr_t,
}
#[test]
fn bindgen_test_layout_remote_name_req_cancel_cp() {
    const UNINIT: ::std::mem::MaybeUninit<remote_name_req_cancel_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<remote_name_req_cancel_cp>(),
        6usize,
        concat!("Size of: ", stringify!(remote_name_req_cancel_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<remote_name_req_cancel_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(remote_name_req_cancel_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bdaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(remote_name_req_cancel_cp),
            "::",
            stringify!(bdaddr)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct read_remote_features_cp {
    pub handle: u16,
}
#[test]
fn bindgen_test_layout_read_remote_features_cp() {
    const UNINIT: ::std::mem::MaybeUninit<read_remote_features_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<read_remote_features_cp>(),
        2usize,
        concat!("Size of: ", stringify!(read_remote_features_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<read_remote_features_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(read_remote_features_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(read_remote_features_cp),
            "::",
            stringify!(handle)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct read_remote_ext_features_cp {
    pub handle: u16,
    pub page_num: u8,
}
#[test]
fn bindgen_test_layout_read_remote_ext_features_cp() {
    const UNINIT: ::std::mem::MaybeUninit<read_remote_ext_features_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<read_remote_ext_features_cp>(),
        3usize,
        concat!("Size of: ", stringify!(read_remote_ext_features_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<read_remote_ext_features_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(read_remote_ext_features_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(read_remote_ext_features_cp),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).page_num) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(read_remote_ext_features_cp),
            "::",
            stringify!(page_num)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct read_remote_version_cp {
    pub handle: u16,
}
#[test]
fn bindgen_test_layout_read_remote_version_cp() {
    const UNINIT: ::std::mem::MaybeUninit<read_remote_version_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<read_remote_version_cp>(),
        2usize,
        concat!("Size of: ", stringify!(read_remote_version_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<read_remote_version_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(read_remote_version_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(read_remote_version_cp),
            "::",
            stringify!(handle)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct read_clock_offset_cp {
    pub handle: u16,
}
#[test]
fn bindgen_test_layout_read_clock_offset_cp() {
    const UNINIT: ::std::mem::MaybeUninit<read_clock_offset_cp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<read_clock_offset_cp>(),
        2usize,
        concat!("Size of: ", stringify!(read_clock_offset_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<read_clock_offset_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(read_clock_offset_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(read_clock_offset_cp),
            "::",
            stringify!(handle)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct setup_sync_conn_cp {
    pub handle: u16,
    pub tx_bandwith: u32,
    pub rx_bandwith: u32,
    pub max_latency: u16,
    pub voice_setting: u16,
    pub retrans_effort: u8,
    pub pkt_type: u16,
}
#[test]
fn bindgen_test_layout_setup_sync_conn_cp() {
    const UNINIT: ::std::mem::MaybeUninit<setup_sync_conn_cp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<setup_sync_conn_cp>(),
        17usize,
        concat!("Size of: ", stringify!(setup_sync_conn_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<setup_sync_conn_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(setup_sync_conn_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(setup_sync_conn_cp),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tx_bandwith) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(setup_sync_conn_cp),
            "::",
            stringify!(tx_bandwith)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rx_bandwith) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(setup_sync_conn_cp),
            "::",
            stringify!(rx_bandwith)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_latency) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(setup_sync_conn_cp),
            "::",
            stringify!(max_latency)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).voice_setting) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(setup_sync_conn_cp),
            "::",
            stringify!(voice_setting)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).retrans_effort) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(setup_sync_conn_cp),
            "::",
            stringify!(retrans_effort)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pkt_type) as usize - ptr as usize },
        15usize,
        concat!(
            "Offset of field: ",
            stringify!(setup_sync_conn_cp),
            "::",
            stringify!(pkt_type)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct accept_sync_conn_req_cp {
    pub bdaddr: bdaddr_t,
    pub tx_bandwith: u32,
    pub rx_bandwith: u32,
    pub max_latency: u16,
    pub voice_setting: u16,
    pub retrans_effort: u8,
    pub pkt_type: u16,
}
#[test]
fn bindgen_test_layout_accept_sync_conn_req_cp() {
    const UNINIT: ::std::mem::MaybeUninit<accept_sync_conn_req_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<accept_sync_conn_req_cp>(),
        21usize,
        concat!("Size of: ", stringify!(accept_sync_conn_req_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<accept_sync_conn_req_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(accept_sync_conn_req_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bdaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(accept_sync_conn_req_cp),
            "::",
            stringify!(bdaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tx_bandwith) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(accept_sync_conn_req_cp),
            "::",
            stringify!(tx_bandwith)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rx_bandwith) as usize - ptr as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(accept_sync_conn_req_cp),
            "::",
            stringify!(rx_bandwith)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_latency) as usize - ptr as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(accept_sync_conn_req_cp),
            "::",
            stringify!(max_latency)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).voice_setting) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(accept_sync_conn_req_cp),
            "::",
            stringify!(voice_setting)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).retrans_effort) as usize - ptr as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(accept_sync_conn_req_cp),
            "::",
            stringify!(retrans_effort)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pkt_type) as usize - ptr as usize },
        19usize,
        concat!(
            "Offset of field: ",
            stringify!(accept_sync_conn_req_cp),
            "::",
            stringify!(pkt_type)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct reject_sync_conn_req_cp {
    pub bdaddr: bdaddr_t,
    pub reason: u8,
}
#[test]
fn bindgen_test_layout_reject_sync_conn_req_cp() {
    const UNINIT: ::std::mem::MaybeUninit<reject_sync_conn_req_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<reject_sync_conn_req_cp>(),
        7usize,
        concat!("Size of: ", stringify!(reject_sync_conn_req_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<reject_sync_conn_req_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(reject_sync_conn_req_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bdaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(reject_sync_conn_req_cp),
            "::",
            stringify!(bdaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reason) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(reject_sync_conn_req_cp),
            "::",
            stringify!(reason)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct io_capability_reply_cp {
    pub bdaddr: bdaddr_t,
    pub capability: u8,
    pub oob_data: u8,
    pub authentication: u8,
}
#[test]
fn bindgen_test_layout_io_capability_reply_cp() {
    const UNINIT: ::std::mem::MaybeUninit<io_capability_reply_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<io_capability_reply_cp>(),
        9usize,
        concat!("Size of: ", stringify!(io_capability_reply_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<io_capability_reply_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(io_capability_reply_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bdaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(io_capability_reply_cp),
            "::",
            stringify!(bdaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).capability) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(io_capability_reply_cp),
            "::",
            stringify!(capability)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).oob_data) as usize - ptr as usize },
        7usize,
        concat!(
            "Offset of field: ",
            stringify!(io_capability_reply_cp),
            "::",
            stringify!(oob_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).authentication) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(io_capability_reply_cp),
            "::",
            stringify!(authentication)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct user_confirm_reply_cp {
    pub bdaddr: bdaddr_t,
}
#[test]
fn bindgen_test_layout_user_confirm_reply_cp() {
    const UNINIT: ::std::mem::MaybeUninit<user_confirm_reply_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<user_confirm_reply_cp>(),
        6usize,
        concat!("Size of: ", stringify!(user_confirm_reply_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<user_confirm_reply_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(user_confirm_reply_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bdaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(user_confirm_reply_cp),
            "::",
            stringify!(bdaddr)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct user_passkey_reply_cp {
    pub bdaddr: bdaddr_t,
    pub passkey: u32,
}
#[test]
fn bindgen_test_layout_user_passkey_reply_cp() {
    const UNINIT: ::std::mem::MaybeUninit<user_passkey_reply_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<user_passkey_reply_cp>(),
        10usize,
        concat!("Size of: ", stringify!(user_passkey_reply_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<user_passkey_reply_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(user_passkey_reply_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bdaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(user_passkey_reply_cp),
            "::",
            stringify!(bdaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).passkey) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(user_passkey_reply_cp),
            "::",
            stringify!(passkey)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct remote_oob_data_reply_cp {
    pub bdaddr: bdaddr_t,
    pub hash: [u8; 16usize],
    pub randomizer: [u8; 16usize],
}
#[test]
fn bindgen_test_layout_remote_oob_data_reply_cp() {
    const UNINIT: ::std::mem::MaybeUninit<remote_oob_data_reply_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<remote_oob_data_reply_cp>(),
        38usize,
        concat!("Size of: ", stringify!(remote_oob_data_reply_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<remote_oob_data_reply_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(remote_oob_data_reply_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bdaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(remote_oob_data_reply_cp),
            "::",
            stringify!(bdaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hash) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(remote_oob_data_reply_cp),
            "::",
            stringify!(hash)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).randomizer) as usize - ptr as usize },
        22usize,
        concat!(
            "Offset of field: ",
            stringify!(remote_oob_data_reply_cp),
            "::",
            stringify!(randomizer)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct io_capability_neg_reply_cp {
    pub bdaddr: bdaddr_t,
    pub reason: u8,
}
#[test]
fn bindgen_test_layout_io_capability_neg_reply_cp() {
    const UNINIT: ::std::mem::MaybeUninit<io_capability_neg_reply_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<io_capability_neg_reply_cp>(),
        7usize,
        concat!("Size of: ", stringify!(io_capability_neg_reply_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<io_capability_neg_reply_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(io_capability_neg_reply_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bdaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(io_capability_neg_reply_cp),
            "::",
            stringify!(bdaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reason) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(io_capability_neg_reply_cp),
            "::",
            stringify!(reason)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct create_physical_link_cp {
    pub handle: u8,
    pub key_length: u8,
    pub key_type: u8,
    pub key: [u8; 32usize],
}
#[test]
fn bindgen_test_layout_create_physical_link_cp() {
    const UNINIT: ::std::mem::MaybeUninit<create_physical_link_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<create_physical_link_cp>(),
        35usize,
        concat!("Size of: ", stringify!(create_physical_link_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<create_physical_link_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(create_physical_link_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(create_physical_link_cp),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key_length) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(create_physical_link_cp),
            "::",
            stringify!(key_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key_type) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(create_physical_link_cp),
            "::",
            stringify!(key_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(create_physical_link_cp),
            "::",
            stringify!(key)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct accept_physical_link_cp {
    pub handle: u8,
    pub key_length: u8,
    pub key_type: u8,
    pub key: [u8; 32usize],
}
#[test]
fn bindgen_test_layout_accept_physical_link_cp() {
    const UNINIT: ::std::mem::MaybeUninit<accept_physical_link_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<accept_physical_link_cp>(),
        35usize,
        concat!("Size of: ", stringify!(accept_physical_link_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<accept_physical_link_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(accept_physical_link_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(accept_physical_link_cp),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key_length) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(accept_physical_link_cp),
            "::",
            stringify!(key_length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key_type) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(accept_physical_link_cp),
            "::",
            stringify!(key_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(accept_physical_link_cp),
            "::",
            stringify!(key)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct disconnect_physical_link_cp {
    pub handle: u8,
    pub reason: u8,
}
#[test]
fn bindgen_test_layout_disconnect_physical_link_cp() {
    const UNINIT: ::std::mem::MaybeUninit<disconnect_physical_link_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<disconnect_physical_link_cp>(),
        2usize,
        concat!("Size of: ", stringify!(disconnect_physical_link_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<disconnect_physical_link_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(disconnect_physical_link_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(disconnect_physical_link_cp),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reason) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(disconnect_physical_link_cp),
            "::",
            stringify!(reason)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct create_logical_link_cp {
    pub handle: u8,
    pub tx_flow: [u8; 16usize],
    pub rx_flow: [u8; 16usize],
}
#[test]
fn bindgen_test_layout_create_logical_link_cp() {
    const UNINIT: ::std::mem::MaybeUninit<create_logical_link_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<create_logical_link_cp>(),
        33usize,
        concat!("Size of: ", stringify!(create_logical_link_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<create_logical_link_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(create_logical_link_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(create_logical_link_cp),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tx_flow) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(create_logical_link_cp),
            "::",
            stringify!(tx_flow)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rx_flow) as usize - ptr as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(create_logical_link_cp),
            "::",
            stringify!(rx_flow)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct disconnect_logical_link_cp {
    pub handle: u16,
}
#[test]
fn bindgen_test_layout_disconnect_logical_link_cp() {
    const UNINIT: ::std::mem::MaybeUninit<disconnect_logical_link_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<disconnect_logical_link_cp>(),
        2usize,
        concat!("Size of: ", stringify!(disconnect_logical_link_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<disconnect_logical_link_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(disconnect_logical_link_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(disconnect_logical_link_cp),
            "::",
            stringify!(handle)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct cancel_logical_link_cp {
    pub handle: u8,
    pub tx_flow_id: u8,
}
#[test]
fn bindgen_test_layout_cancel_logical_link_cp() {
    const UNINIT: ::std::mem::MaybeUninit<cancel_logical_link_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cancel_logical_link_cp>(),
        2usize,
        concat!("Size of: ", stringify!(cancel_logical_link_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<cancel_logical_link_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(cancel_logical_link_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cancel_logical_link_cp),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tx_flow_id) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(cancel_logical_link_cp),
            "::",
            stringify!(tx_flow_id)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct cancel_logical_link_rp {
    pub status: u8,
    pub handle: u8,
    pub tx_flow_id: u8,
}
#[test]
fn bindgen_test_layout_cancel_logical_link_rp() {
    const UNINIT: ::std::mem::MaybeUninit<cancel_logical_link_rp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<cancel_logical_link_rp>(),
        3usize,
        concat!("Size of: ", stringify!(cancel_logical_link_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<cancel_logical_link_rp>(),
        1usize,
        concat!("Alignment of ", stringify!(cancel_logical_link_rp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(cancel_logical_link_rp),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(cancel_logical_link_rp),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).tx_flow_id) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(cancel_logical_link_rp),
            "::",
            stringify!(tx_flow_id)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct hold_mode_cp {
    pub handle: u16,
    pub max_interval: u16,
    pub min_interval: u16,
}
#[test]
fn bindgen_test_layout_hold_mode_cp() {
    const UNINIT: ::std::mem::MaybeUninit<hold_mode_cp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<hold_mode_cp>(),
        6usize,
        concat!("Size of: ", stringify!(hold_mode_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<hold_mode_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(hold_mode_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hold_mode_cp),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_interval) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(hold_mode_cp),
            "::",
            stringify!(max_interval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_interval) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(hold_mode_cp),
            "::",
            stringify!(min_interval)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sniff_mode_cp {
    pub handle: u16,
    pub max_interval: u16,
    pub min_interval: u16,
    pub attempt: u16,
    pub timeout: u16,
}
#[test]
fn bindgen_test_layout_sniff_mode_cp() {
    const UNINIT: ::std::mem::MaybeUninit<sniff_mode_cp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sniff_mode_cp>(),
        10usize,
        concat!("Size of: ", stringify!(sniff_mode_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<sniff_mode_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(sniff_mode_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sniff_mode_cp),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_interval) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sniff_mode_cp),
            "::",
            stringify!(max_interval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_interval) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sniff_mode_cp),
            "::",
            stringify!(min_interval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).attempt) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(sniff_mode_cp),
            "::",
            stringify!(attempt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeout) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(sniff_mode_cp),
            "::",
            stringify!(timeout)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct exit_sniff_mode_cp {
    pub handle: u16,
}
#[test]
fn bindgen_test_layout_exit_sniff_mode_cp() {
    const UNINIT: ::std::mem::MaybeUninit<exit_sniff_mode_cp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<exit_sniff_mode_cp>(),
        2usize,
        concat!("Size of: ", stringify!(exit_sniff_mode_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<exit_sniff_mode_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(exit_sniff_mode_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(exit_sniff_mode_cp),
            "::",
            stringify!(handle)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct park_mode_cp {
    pub handle: u16,
    pub max_interval: u16,
    pub min_interval: u16,
}
#[test]
fn bindgen_test_layout_park_mode_cp() {
    const UNINIT: ::std::mem::MaybeUninit<park_mode_cp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<park_mode_cp>(),
        6usize,
        concat!("Size of: ", stringify!(park_mode_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<park_mode_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(park_mode_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(park_mode_cp),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_interval) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(park_mode_cp),
            "::",
            stringify!(max_interval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_interval) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(park_mode_cp),
            "::",
            stringify!(min_interval)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct exit_park_mode_cp {
    pub handle: u16,
}
#[test]
fn bindgen_test_layout_exit_park_mode_cp() {
    const UNINIT: ::std::mem::MaybeUninit<exit_park_mode_cp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<exit_park_mode_cp>(),
        2usize,
        concat!("Size of: ", stringify!(exit_park_mode_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<exit_park_mode_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(exit_park_mode_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(exit_park_mode_cp),
            "::",
            stringify!(handle)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct hci_qos {
    pub service_type: u8,
    pub token_rate: u32,
    pub peak_bandwidth: u32,
    pub latency: u32,
    pub delay_variation: u32,
}
#[test]
fn bindgen_test_layout_hci_qos() {
    const UNINIT: ::std::mem::MaybeUninit<hci_qos> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<hci_qos>(),
        17usize,
        concat!("Size of: ", stringify!(hci_qos))
    );
    assert_eq!(
        ::std::mem::align_of::<hci_qos>(),
        1usize,
        concat!("Alignment of ", stringify!(hci_qos))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).service_type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(hci_qos),
            "::",
            stringify!(service_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).token_rate) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(hci_qos),
            "::",
            stringify!(token_rate)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).peak_bandwidth) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(hci_qos),
            "::",
            stringify!(peak_bandwidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).latency) as usize - ptr as usize },
        9usize,
        concat!(
            "Offset of field: ",
            stringify!(hci_qos),
            "::",
            stringify!(latency)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).delay_variation) as usize - ptr as usize },
        13usize,
        concat!(
            "Offset of field: ",
            stringify!(hci_qos),
            "::",
            stringify!(delay_variation)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct qos_setup_cp {
    pub handle: u16,
    pub flags: u8,
    pub qos: hci_qos,
}
#[test]
fn bindgen_test_layout_qos_setup_cp() {
    const UNINIT: ::std::mem::MaybeUninit<qos_setup_cp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<qos_setup_cp>(),
        20usize,
        concat!("Size of: ", stringify!(qos_setup_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<qos_setup_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(qos_setup_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(qos_setup_cp),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(qos_setup_cp),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).qos) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(qos_setup_cp),
            "::",
            stringify!(qos)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct role_discovery_cp {
    pub handle: u16,
}
#[test]
fn bindgen_test_layout_role_discovery_cp() {
    const UNINIT: ::std::mem::MaybeUninit<role_discovery_cp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<role_discovery_cp>(),
        2usize,
        concat!("Size of: ", stringify!(role_discovery_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<role_discovery_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(role_discovery_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(role_discovery_cp),
            "::",
            stringify!(handle)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct role_discovery_rp {
    pub status: u8,
    pub handle: u16,
    pub role: u8,
}
#[test]
fn bindgen_test_layout_role_discovery_rp() {
    const UNINIT: ::std::mem::MaybeUninit<role_discovery_rp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<role_discovery_rp>(),
        4usize,
        concat!("Size of: ", stringify!(role_discovery_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<role_discovery_rp>(),
        1usize,
        concat!("Alignment of ", stringify!(role_discovery_rp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(role_discovery_rp),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(role_discovery_rp),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).role) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(role_discovery_rp),
            "::",
            stringify!(role)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct switch_role_cp {
    pub bdaddr: bdaddr_t,
    pub role: u8,
}
#[test]
fn bindgen_test_layout_switch_role_cp() {
    const UNINIT: ::std::mem::MaybeUninit<switch_role_cp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<switch_role_cp>(),
        7usize,
        concat!("Size of: ", stringify!(switch_role_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<switch_role_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(switch_role_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bdaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(switch_role_cp),
            "::",
            stringify!(bdaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).role) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(switch_role_cp),
            "::",
            stringify!(role)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct read_link_policy_cp {
    pub handle: u16,
}
#[test]
fn bindgen_test_layout_read_link_policy_cp() {
    const UNINIT: ::std::mem::MaybeUninit<read_link_policy_cp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<read_link_policy_cp>(),
        2usize,
        concat!("Size of: ", stringify!(read_link_policy_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<read_link_policy_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(read_link_policy_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(read_link_policy_cp),
            "::",
            stringify!(handle)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct read_link_policy_rp {
    pub status: u8,
    pub handle: u16,
    pub policy: u16,
}
#[test]
fn bindgen_test_layout_read_link_policy_rp() {
    const UNINIT: ::std::mem::MaybeUninit<read_link_policy_rp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<read_link_policy_rp>(),
        5usize,
        concat!("Size of: ", stringify!(read_link_policy_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<read_link_policy_rp>(),
        1usize,
        concat!("Alignment of ", stringify!(read_link_policy_rp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(read_link_policy_rp),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(read_link_policy_rp),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).policy) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(read_link_policy_rp),
            "::",
            stringify!(policy)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct write_link_policy_cp {
    pub handle: u16,
    pub policy: u16,
}
#[test]
fn bindgen_test_layout_write_link_policy_cp() {
    const UNINIT: ::std::mem::MaybeUninit<write_link_policy_cp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<write_link_policy_cp>(),
        4usize,
        concat!("Size of: ", stringify!(write_link_policy_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<write_link_policy_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(write_link_policy_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(write_link_policy_cp),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).policy) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(write_link_policy_cp),
            "::",
            stringify!(policy)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct write_link_policy_rp {
    pub status: u8,
    pub handle: u16,
}
#[test]
fn bindgen_test_layout_write_link_policy_rp() {
    const UNINIT: ::std::mem::MaybeUninit<write_link_policy_rp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<write_link_policy_rp>(),
        3usize,
        concat!("Size of: ", stringify!(write_link_policy_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<write_link_policy_rp>(),
        1usize,
        concat!("Alignment of ", stringify!(write_link_policy_rp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(write_link_policy_rp),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(write_link_policy_rp),
            "::",
            stringify!(handle)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sniff_subrating_cp {
    pub handle: u16,
    pub max_latency: u16,
    pub min_remote_timeout: u16,
    pub min_local_timeout: u16,
}
#[test]
fn bindgen_test_layout_sniff_subrating_cp() {
    const UNINIT: ::std::mem::MaybeUninit<sniff_subrating_cp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<sniff_subrating_cp>(),
        8usize,
        concat!("Size of: ", stringify!(sniff_subrating_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<sniff_subrating_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(sniff_subrating_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(sniff_subrating_cp),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_latency) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(sniff_subrating_cp),
            "::",
            stringify!(max_latency)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_remote_timeout) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(sniff_subrating_cp),
            "::",
            stringify!(min_remote_timeout)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_local_timeout) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(sniff_subrating_cp),
            "::",
            stringify!(min_local_timeout)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct set_event_mask_cp {
    pub mask: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_set_event_mask_cp() {
    const UNINIT: ::std::mem::MaybeUninit<set_event_mask_cp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<set_event_mask_cp>(),
        8usize,
        concat!("Size of: ", stringify!(set_event_mask_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<set_event_mask_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(set_event_mask_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mask) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(set_event_mask_cp),
            "::",
            stringify!(mask)
        )
    );
}
#[repr(C, packed)]
pub struct set_event_flt_cp {
    pub flt_type: u8,
    pub cond_type: u8,
    pub condition: __IncompleteArrayField<u8>,
}
#[test]
fn bindgen_test_layout_set_event_flt_cp() {
    const UNINIT: ::std::mem::MaybeUninit<set_event_flt_cp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<set_event_flt_cp>(),
        2usize,
        concat!("Size of: ", stringify!(set_event_flt_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<set_event_flt_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(set_event_flt_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flt_type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(set_event_flt_cp),
            "::",
            stringify!(flt_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cond_type) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(set_event_flt_cp),
            "::",
            stringify!(cond_type)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).condition) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(set_event_flt_cp),
            "::",
            stringify!(condition)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct read_pin_type_rp {
    pub status: u8,
    pub pin_type: u8,
}
#[test]
fn bindgen_test_layout_read_pin_type_rp() {
    const UNINIT: ::std::mem::MaybeUninit<read_pin_type_rp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<read_pin_type_rp>(),
        2usize,
        concat!("Size of: ", stringify!(read_pin_type_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<read_pin_type_rp>(),
        1usize,
        concat!("Alignment of ", stringify!(read_pin_type_rp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(read_pin_type_rp),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pin_type) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(read_pin_type_rp),
            "::",
            stringify!(pin_type)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct write_pin_type_cp {
    pub pin_type: u8,
}
#[test]
fn bindgen_test_layout_write_pin_type_cp() {
    const UNINIT: ::std::mem::MaybeUninit<write_pin_type_cp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<write_pin_type_cp>(),
        1usize,
        concat!("Size of: ", stringify!(write_pin_type_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<write_pin_type_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(write_pin_type_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pin_type) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(write_pin_type_cp),
            "::",
            stringify!(pin_type)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct read_stored_link_key_cp {
    pub bdaddr: bdaddr_t,
    pub read_all: u8,
}
#[test]
fn bindgen_test_layout_read_stored_link_key_cp() {
    const UNINIT: ::std::mem::MaybeUninit<read_stored_link_key_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<read_stored_link_key_cp>(),
        7usize,
        concat!("Size of: ", stringify!(read_stored_link_key_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<read_stored_link_key_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(read_stored_link_key_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bdaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(read_stored_link_key_cp),
            "::",
            stringify!(bdaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).read_all) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(read_stored_link_key_cp),
            "::",
            stringify!(read_all)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct read_stored_link_key_rp {
    pub status: u8,
    pub max_keys: u16,
    pub num_keys: u16,
}
#[test]
fn bindgen_test_layout_read_stored_link_key_rp() {
    const UNINIT: ::std::mem::MaybeUninit<read_stored_link_key_rp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<read_stored_link_key_rp>(),
        5usize,
        concat!("Size of: ", stringify!(read_stored_link_key_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<read_stored_link_key_rp>(),
        1usize,
        concat!("Alignment of ", stringify!(read_stored_link_key_rp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(read_stored_link_key_rp),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_keys) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(read_stored_link_key_rp),
            "::",
            stringify!(max_keys)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_keys) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(read_stored_link_key_rp),
            "::",
            stringify!(num_keys)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct write_stored_link_key_cp {
    pub num_keys: u8,
}
#[test]
fn bindgen_test_layout_write_stored_link_key_cp() {
    const UNINIT: ::std::mem::MaybeUninit<write_stored_link_key_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<write_stored_link_key_cp>(),
        1usize,
        concat!("Size of: ", stringify!(write_stored_link_key_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<write_stored_link_key_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(write_stored_link_key_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_keys) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(write_stored_link_key_cp),
            "::",
            stringify!(num_keys)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct write_stored_link_key_rp {
    pub status: u8,
    pub num_keys: u8,
}
#[test]
fn bindgen_test_layout_write_stored_link_key_rp() {
    const UNINIT: ::std::mem::MaybeUninit<write_stored_link_key_rp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<write_stored_link_key_rp>(),
        2usize,
        concat!("Size of: ", stringify!(write_stored_link_key_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<write_stored_link_key_rp>(),
        1usize,
        concat!("Alignment of ", stringify!(write_stored_link_key_rp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(write_stored_link_key_rp),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_keys) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(write_stored_link_key_rp),
            "::",
            stringify!(num_keys)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct delete_stored_link_key_cp {
    pub bdaddr: bdaddr_t,
    pub delete_all: u8,
}
#[test]
fn bindgen_test_layout_delete_stored_link_key_cp() {
    const UNINIT: ::std::mem::MaybeUninit<delete_stored_link_key_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<delete_stored_link_key_cp>(),
        7usize,
        concat!("Size of: ", stringify!(delete_stored_link_key_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<delete_stored_link_key_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(delete_stored_link_key_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bdaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(delete_stored_link_key_cp),
            "::",
            stringify!(bdaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).delete_all) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(delete_stored_link_key_cp),
            "::",
            stringify!(delete_all)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct delete_stored_link_key_rp {
    pub status: u8,
    pub num_keys: u16,
}
#[test]
fn bindgen_test_layout_delete_stored_link_key_rp() {
    const UNINIT: ::std::mem::MaybeUninit<delete_stored_link_key_rp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<delete_stored_link_key_rp>(),
        3usize,
        concat!("Size of: ", stringify!(delete_stored_link_key_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<delete_stored_link_key_rp>(),
        1usize,
        concat!("Alignment of ", stringify!(delete_stored_link_key_rp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(delete_stored_link_key_rp),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_keys) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(delete_stored_link_key_rp),
            "::",
            stringify!(num_keys)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct change_local_name_cp {
    pub name: [u8; 248usize],
}
#[test]
fn bindgen_test_layout_change_local_name_cp() {
    const UNINIT: ::std::mem::MaybeUninit<change_local_name_cp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<change_local_name_cp>(),
        248usize,
        concat!("Size of: ", stringify!(change_local_name_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<change_local_name_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(change_local_name_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(change_local_name_cp),
            "::",
            stringify!(name)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct read_local_name_rp {
    pub status: u8,
    pub name: [u8; 248usize],
}
#[test]
fn bindgen_test_layout_read_local_name_rp() {
    const UNINIT: ::std::mem::MaybeUninit<read_local_name_rp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<read_local_name_rp>(),
        249usize,
        concat!("Size of: ", stringify!(read_local_name_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<read_local_name_rp>(),
        1usize,
        concat!("Alignment of ", stringify!(read_local_name_rp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(read_local_name_rp),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(read_local_name_rp),
            "::",
            stringify!(name)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct read_conn_accept_timeout_rp {
    pub status: u8,
    pub timeout: u16,
}
#[test]
fn bindgen_test_layout_read_conn_accept_timeout_rp() {
    const UNINIT: ::std::mem::MaybeUninit<read_conn_accept_timeout_rp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<read_conn_accept_timeout_rp>(),
        3usize,
        concat!("Size of: ", stringify!(read_conn_accept_timeout_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<read_conn_accept_timeout_rp>(),
        1usize,
        concat!("Alignment of ", stringify!(read_conn_accept_timeout_rp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(read_conn_accept_timeout_rp),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeout) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(read_conn_accept_timeout_rp),
            "::",
            stringify!(timeout)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct write_conn_accept_timeout_cp {
    pub timeout: u16,
}
#[test]
fn bindgen_test_layout_write_conn_accept_timeout_cp() {
    const UNINIT: ::std::mem::MaybeUninit<write_conn_accept_timeout_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<write_conn_accept_timeout_cp>(),
        2usize,
        concat!("Size of: ", stringify!(write_conn_accept_timeout_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<write_conn_accept_timeout_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(write_conn_accept_timeout_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeout) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(write_conn_accept_timeout_cp),
            "::",
            stringify!(timeout)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct read_page_timeout_rp {
    pub status: u8,
    pub timeout: u16,
}
#[test]
fn bindgen_test_layout_read_page_timeout_rp() {
    const UNINIT: ::std::mem::MaybeUninit<read_page_timeout_rp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<read_page_timeout_rp>(),
        3usize,
        concat!("Size of: ", stringify!(read_page_timeout_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<read_page_timeout_rp>(),
        1usize,
        concat!("Alignment of ", stringify!(read_page_timeout_rp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(read_page_timeout_rp),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeout) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(read_page_timeout_rp),
            "::",
            stringify!(timeout)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct write_page_timeout_cp {
    pub timeout: u16,
}
#[test]
fn bindgen_test_layout_write_page_timeout_cp() {
    const UNINIT: ::std::mem::MaybeUninit<write_page_timeout_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<write_page_timeout_cp>(),
        2usize,
        concat!("Size of: ", stringify!(write_page_timeout_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<write_page_timeout_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(write_page_timeout_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeout) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(write_page_timeout_cp),
            "::",
            stringify!(timeout)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct read_scan_enable_rp {
    pub status: u8,
    pub enable: u8,
}
#[test]
fn bindgen_test_layout_read_scan_enable_rp() {
    const UNINIT: ::std::mem::MaybeUninit<read_scan_enable_rp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<read_scan_enable_rp>(),
        2usize,
        concat!("Size of: ", stringify!(read_scan_enable_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<read_scan_enable_rp>(),
        1usize,
        concat!("Alignment of ", stringify!(read_scan_enable_rp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(read_scan_enable_rp),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enable) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(read_scan_enable_rp),
            "::",
            stringify!(enable)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct read_page_activity_rp {
    pub status: u8,
    pub interval: u16,
    pub window: u16,
}
#[test]
fn bindgen_test_layout_read_page_activity_rp() {
    const UNINIT: ::std::mem::MaybeUninit<read_page_activity_rp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<read_page_activity_rp>(),
        5usize,
        concat!("Size of: ", stringify!(read_page_activity_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<read_page_activity_rp>(),
        1usize,
        concat!("Alignment of ", stringify!(read_page_activity_rp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(read_page_activity_rp),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interval) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(read_page_activity_rp),
            "::",
            stringify!(interval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).window) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(read_page_activity_rp),
            "::",
            stringify!(window)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct write_page_activity_cp {
    pub interval: u16,
    pub window: u16,
}
#[test]
fn bindgen_test_layout_write_page_activity_cp() {
    const UNINIT: ::std::mem::MaybeUninit<write_page_activity_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<write_page_activity_cp>(),
        4usize,
        concat!("Size of: ", stringify!(write_page_activity_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<write_page_activity_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(write_page_activity_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interval) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(write_page_activity_cp),
            "::",
            stringify!(interval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).window) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(write_page_activity_cp),
            "::",
            stringify!(window)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct read_inq_activity_rp {
    pub status: u8,
    pub interval: u16,
    pub window: u16,
}
#[test]
fn bindgen_test_layout_read_inq_activity_rp() {
    const UNINIT: ::std::mem::MaybeUninit<read_inq_activity_rp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<read_inq_activity_rp>(),
        5usize,
        concat!("Size of: ", stringify!(read_inq_activity_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<read_inq_activity_rp>(),
        1usize,
        concat!("Alignment of ", stringify!(read_inq_activity_rp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(read_inq_activity_rp),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interval) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(read_inq_activity_rp),
            "::",
            stringify!(interval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).window) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(read_inq_activity_rp),
            "::",
            stringify!(window)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct write_inq_activity_cp {
    pub interval: u16,
    pub window: u16,
}
#[test]
fn bindgen_test_layout_write_inq_activity_cp() {
    const UNINIT: ::std::mem::MaybeUninit<write_inq_activity_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<write_inq_activity_cp>(),
        4usize,
        concat!("Size of: ", stringify!(write_inq_activity_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<write_inq_activity_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(write_inq_activity_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interval) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(write_inq_activity_cp),
            "::",
            stringify!(interval)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).window) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(write_inq_activity_cp),
            "::",
            stringify!(window)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct read_class_of_dev_rp {
    pub status: u8,
    pub dev_class: [u8; 3usize],
}
#[test]
fn bindgen_test_layout_read_class_of_dev_rp() {
    const UNINIT: ::std::mem::MaybeUninit<read_class_of_dev_rp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<read_class_of_dev_rp>(),
        4usize,
        concat!("Size of: ", stringify!(read_class_of_dev_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<read_class_of_dev_rp>(),
        1usize,
        concat!("Alignment of ", stringify!(read_class_of_dev_rp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(read_class_of_dev_rp),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dev_class) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(read_class_of_dev_rp),
            "::",
            stringify!(dev_class)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct write_class_of_dev_cp {
    pub dev_class: [u8; 3usize],
}
#[test]
fn bindgen_test_layout_write_class_of_dev_cp() {
    const UNINIT: ::std::mem::MaybeUninit<write_class_of_dev_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<write_class_of_dev_cp>(),
        3usize,
        concat!("Size of: ", stringify!(write_class_of_dev_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<write_class_of_dev_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(write_class_of_dev_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dev_class) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(write_class_of_dev_cp),
            "::",
            stringify!(dev_class)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct read_voice_setting_rp {
    pub status: u8,
    pub voice_setting: u16,
}
#[test]
fn bindgen_test_layout_read_voice_setting_rp() {
    const UNINIT: ::std::mem::MaybeUninit<read_voice_setting_rp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<read_voice_setting_rp>(),
        3usize,
        concat!("Size of: ", stringify!(read_voice_setting_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<read_voice_setting_rp>(),
        1usize,
        concat!("Alignment of ", stringify!(read_voice_setting_rp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(read_voice_setting_rp),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).voice_setting) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(read_voice_setting_rp),
            "::",
            stringify!(voice_setting)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct write_voice_setting_cp {
    pub voice_setting: u16,
}
#[test]
fn bindgen_test_layout_write_voice_setting_cp() {
    const UNINIT: ::std::mem::MaybeUninit<write_voice_setting_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<write_voice_setting_cp>(),
        2usize,
        concat!("Size of: ", stringify!(write_voice_setting_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<write_voice_setting_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(write_voice_setting_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).voice_setting) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(write_voice_setting_cp),
            "::",
            stringify!(voice_setting)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct read_transmit_power_level_cp {
    pub handle: u16,
    pub type_: u8,
}
#[test]
fn bindgen_test_layout_read_transmit_power_level_cp() {
    const UNINIT: ::std::mem::MaybeUninit<read_transmit_power_level_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<read_transmit_power_level_cp>(),
        3usize,
        concat!("Size of: ", stringify!(read_transmit_power_level_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<read_transmit_power_level_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(read_transmit_power_level_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(read_transmit_power_level_cp),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(read_transmit_power_level_cp),
            "::",
            stringify!(type_)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct read_transmit_power_level_rp {
    pub status: u8,
    pub handle: u16,
    pub level: i8,
}
#[test]
fn bindgen_test_layout_read_transmit_power_level_rp() {
    const UNINIT: ::std::mem::MaybeUninit<read_transmit_power_level_rp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<read_transmit_power_level_rp>(),
        4usize,
        concat!("Size of: ", stringify!(read_transmit_power_level_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<read_transmit_power_level_rp>(),
        1usize,
        concat!("Alignment of ", stringify!(read_transmit_power_level_rp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(read_transmit_power_level_rp),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(read_transmit_power_level_rp),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).level) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(read_transmit_power_level_rp),
            "::",
            stringify!(level)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct host_buffer_size_cp {
    pub acl_mtu: u16,
    pub sco_mtu: u8,
    pub acl_max_pkt: u16,
    pub sco_max_pkt: u16,
}
#[test]
fn bindgen_test_layout_host_buffer_size_cp() {
    const UNINIT: ::std::mem::MaybeUninit<host_buffer_size_cp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<host_buffer_size_cp>(),
        7usize,
        concat!("Size of: ", stringify!(host_buffer_size_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<host_buffer_size_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(host_buffer_size_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).acl_mtu) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(host_buffer_size_cp),
            "::",
            stringify!(acl_mtu)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sco_mtu) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(host_buffer_size_cp),
            "::",
            stringify!(sco_mtu)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).acl_max_pkt) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(host_buffer_size_cp),
            "::",
            stringify!(acl_max_pkt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sco_max_pkt) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(host_buffer_size_cp),
            "::",
            stringify!(sco_max_pkt)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct host_num_comp_pkts_cp {
    pub num_hndl: u8,
}
#[test]
fn bindgen_test_layout_host_num_comp_pkts_cp() {
    const UNINIT: ::std::mem::MaybeUninit<host_num_comp_pkts_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<host_num_comp_pkts_cp>(),
        1usize,
        concat!("Size of: ", stringify!(host_num_comp_pkts_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<host_num_comp_pkts_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(host_num_comp_pkts_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_hndl) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(host_num_comp_pkts_cp),
            "::",
            stringify!(num_hndl)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct read_link_supervision_timeout_rp {
    pub status: u8,
    pub handle: u16,
    pub timeout: u16,
}
#[test]
fn bindgen_test_layout_read_link_supervision_timeout_rp() {
    const UNINIT: ::std::mem::MaybeUninit<read_link_supervision_timeout_rp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<read_link_supervision_timeout_rp>(),
        5usize,
        concat!("Size of: ", stringify!(read_link_supervision_timeout_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<read_link_supervision_timeout_rp>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(read_link_supervision_timeout_rp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(read_link_supervision_timeout_rp),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(read_link_supervision_timeout_rp),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeout) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(read_link_supervision_timeout_rp),
            "::",
            stringify!(timeout)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct write_link_supervision_timeout_cp {
    pub handle: u16,
    pub timeout: u16,
}
#[test]
fn bindgen_test_layout_write_link_supervision_timeout_cp() {
    const UNINIT: ::std::mem::MaybeUninit<write_link_supervision_timeout_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<write_link_supervision_timeout_cp>(),
        4usize,
        concat!("Size of: ", stringify!(write_link_supervision_timeout_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<write_link_supervision_timeout_cp>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(write_link_supervision_timeout_cp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(write_link_supervision_timeout_cp),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeout) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(write_link_supervision_timeout_cp),
            "::",
            stringify!(timeout)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct write_link_supervision_timeout_rp {
    pub status: u8,
    pub handle: u16,
}
#[test]
fn bindgen_test_layout_write_link_supervision_timeout_rp() {
    const UNINIT: ::std::mem::MaybeUninit<write_link_supervision_timeout_rp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<write_link_supervision_timeout_rp>(),
        3usize,
        concat!("Size of: ", stringify!(write_link_supervision_timeout_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<write_link_supervision_timeout_rp>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(write_link_supervision_timeout_rp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(write_link_supervision_timeout_rp),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(write_link_supervision_timeout_rp),
            "::",
            stringify!(handle)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct read_current_iac_lap_rp {
    pub status: u8,
    pub num_current_iac: u8,
    pub lap: [[u8; 3usize]; 64usize],
}
#[test]
fn bindgen_test_layout_read_current_iac_lap_rp() {
    const UNINIT: ::std::mem::MaybeUninit<read_current_iac_lap_rp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<read_current_iac_lap_rp>(),
        194usize,
        concat!("Size of: ", stringify!(read_current_iac_lap_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<read_current_iac_lap_rp>(),
        1usize,
        concat!("Alignment of ", stringify!(read_current_iac_lap_rp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(read_current_iac_lap_rp),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_current_iac) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(read_current_iac_lap_rp),
            "::",
            stringify!(num_current_iac)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lap) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(read_current_iac_lap_rp),
            "::",
            stringify!(lap)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct write_current_iac_lap_cp {
    pub num_current_iac: u8,
    pub lap: [[u8; 3usize]; 64usize],
}
#[test]
fn bindgen_test_layout_write_current_iac_lap_cp() {
    const UNINIT: ::std::mem::MaybeUninit<write_current_iac_lap_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<write_current_iac_lap_cp>(),
        193usize,
        concat!("Size of: ", stringify!(write_current_iac_lap_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<write_current_iac_lap_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(write_current_iac_lap_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).num_current_iac) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(write_current_iac_lap_cp),
            "::",
            stringify!(num_current_iac)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lap) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(write_current_iac_lap_cp),
            "::",
            stringify!(lap)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct set_afh_classification_cp {
    pub map: [u8; 10usize],
}
#[test]
fn bindgen_test_layout_set_afh_classification_cp() {
    const UNINIT: ::std::mem::MaybeUninit<set_afh_classification_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<set_afh_classification_cp>(),
        10usize,
        concat!("Size of: ", stringify!(set_afh_classification_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<set_afh_classification_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(set_afh_classification_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).map) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(set_afh_classification_cp),
            "::",
            stringify!(map)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct set_afh_classification_rp {
    pub status: u8,
}
#[test]
fn bindgen_test_layout_set_afh_classification_rp() {
    const UNINIT: ::std::mem::MaybeUninit<set_afh_classification_rp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<set_afh_classification_rp>(),
        1usize,
        concat!("Size of: ", stringify!(set_afh_classification_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<set_afh_classification_rp>(),
        1usize,
        concat!("Alignment of ", stringify!(set_afh_classification_rp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(set_afh_classification_rp),
            "::",
            stringify!(status)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct read_inquiry_scan_type_rp {
    pub status: u8,
    pub type_: u8,
}
#[test]
fn bindgen_test_layout_read_inquiry_scan_type_rp() {
    const UNINIT: ::std::mem::MaybeUninit<read_inquiry_scan_type_rp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<read_inquiry_scan_type_rp>(),
        2usize,
        concat!("Size of: ", stringify!(read_inquiry_scan_type_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<read_inquiry_scan_type_rp>(),
        1usize,
        concat!("Alignment of ", stringify!(read_inquiry_scan_type_rp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(read_inquiry_scan_type_rp),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(read_inquiry_scan_type_rp),
            "::",
            stringify!(type_)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct write_inquiry_scan_type_cp {
    pub type_: u8,
}
#[test]
fn bindgen_test_layout_write_inquiry_scan_type_cp() {
    const UNINIT: ::std::mem::MaybeUninit<write_inquiry_scan_type_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<write_inquiry_scan_type_cp>(),
        1usize,
        concat!("Size of: ", stringify!(write_inquiry_scan_type_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<write_inquiry_scan_type_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(write_inquiry_scan_type_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(write_inquiry_scan_type_cp),
            "::",
            stringify!(type_)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct write_inquiry_scan_type_rp {
    pub status: u8,
}
#[test]
fn bindgen_test_layout_write_inquiry_scan_type_rp() {
    const UNINIT: ::std::mem::MaybeUninit<write_inquiry_scan_type_rp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<write_inquiry_scan_type_rp>(),
        1usize,
        concat!("Size of: ", stringify!(write_inquiry_scan_type_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<write_inquiry_scan_type_rp>(),
        1usize,
        concat!("Alignment of ", stringify!(write_inquiry_scan_type_rp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(write_inquiry_scan_type_rp),
            "::",
            stringify!(status)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct read_inquiry_mode_rp {
    pub status: u8,
    pub mode: u8,
}
#[test]
fn bindgen_test_layout_read_inquiry_mode_rp() {
    const UNINIT: ::std::mem::MaybeUninit<read_inquiry_mode_rp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<read_inquiry_mode_rp>(),
        2usize,
        concat!("Size of: ", stringify!(read_inquiry_mode_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<read_inquiry_mode_rp>(),
        1usize,
        concat!("Alignment of ", stringify!(read_inquiry_mode_rp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(read_inquiry_mode_rp),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mode) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(read_inquiry_mode_rp),
            "::",
            stringify!(mode)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct write_inquiry_mode_cp {
    pub mode: u8,
}
#[test]
fn bindgen_test_layout_write_inquiry_mode_cp() {
    const UNINIT: ::std::mem::MaybeUninit<write_inquiry_mode_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<write_inquiry_mode_cp>(),
        1usize,
        concat!("Size of: ", stringify!(write_inquiry_mode_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<write_inquiry_mode_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(write_inquiry_mode_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(write_inquiry_mode_cp),
            "::",
            stringify!(mode)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct write_inquiry_mode_rp {
    pub status: u8,
}
#[test]
fn bindgen_test_layout_write_inquiry_mode_rp() {
    const UNINIT: ::std::mem::MaybeUninit<write_inquiry_mode_rp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<write_inquiry_mode_rp>(),
        1usize,
        concat!("Size of: ", stringify!(write_inquiry_mode_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<write_inquiry_mode_rp>(),
        1usize,
        concat!("Alignment of ", stringify!(write_inquiry_mode_rp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(write_inquiry_mode_rp),
            "::",
            stringify!(status)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct read_afh_mode_rp {
    pub status: u8,
    pub mode: u8,
}
#[test]
fn bindgen_test_layout_read_afh_mode_rp() {
    const UNINIT: ::std::mem::MaybeUninit<read_afh_mode_rp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<read_afh_mode_rp>(),
        2usize,
        concat!("Size of: ", stringify!(read_afh_mode_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<read_afh_mode_rp>(),
        1usize,
        concat!("Alignment of ", stringify!(read_afh_mode_rp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(read_afh_mode_rp),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mode) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(read_afh_mode_rp),
            "::",
            stringify!(mode)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct write_afh_mode_cp {
    pub mode: u8,
}
#[test]
fn bindgen_test_layout_write_afh_mode_cp() {
    const UNINIT: ::std::mem::MaybeUninit<write_afh_mode_cp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<write_afh_mode_cp>(),
        1usize,
        concat!("Size of: ", stringify!(write_afh_mode_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<write_afh_mode_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(write_afh_mode_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(write_afh_mode_cp),
            "::",
            stringify!(mode)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct write_afh_mode_rp {
    pub status: u8,
}
#[test]
fn bindgen_test_layout_write_afh_mode_rp() {
    const UNINIT: ::std::mem::MaybeUninit<write_afh_mode_rp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<write_afh_mode_rp>(),
        1usize,
        concat!("Size of: ", stringify!(write_afh_mode_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<write_afh_mode_rp>(),
        1usize,
        concat!("Alignment of ", stringify!(write_afh_mode_rp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(write_afh_mode_rp),
            "::",
            stringify!(status)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct read_ext_inquiry_response_rp {
    pub status: u8,
    pub fec: u8,
    pub data: [u8; 240usize],
}
#[test]
fn bindgen_test_layout_read_ext_inquiry_response_rp() {
    const UNINIT: ::std::mem::MaybeUninit<read_ext_inquiry_response_rp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<read_ext_inquiry_response_rp>(),
        242usize,
        concat!("Size of: ", stringify!(read_ext_inquiry_response_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<read_ext_inquiry_response_rp>(),
        1usize,
        concat!("Alignment of ", stringify!(read_ext_inquiry_response_rp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(read_ext_inquiry_response_rp),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fec) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(read_ext_inquiry_response_rp),
            "::",
            stringify!(fec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(read_ext_inquiry_response_rp),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct write_ext_inquiry_response_cp {
    pub fec: u8,
    pub data: [u8; 240usize],
}
#[test]
fn bindgen_test_layout_write_ext_inquiry_response_cp() {
    const UNINIT: ::std::mem::MaybeUninit<write_ext_inquiry_response_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<write_ext_inquiry_response_cp>(),
        241usize,
        concat!("Size of: ", stringify!(write_ext_inquiry_response_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<write_ext_inquiry_response_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(write_ext_inquiry_response_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fec) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(write_ext_inquiry_response_cp),
            "::",
            stringify!(fec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(write_ext_inquiry_response_cp),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct write_ext_inquiry_response_rp {
    pub status: u8,
}
#[test]
fn bindgen_test_layout_write_ext_inquiry_response_rp() {
    const UNINIT: ::std::mem::MaybeUninit<write_ext_inquiry_response_rp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<write_ext_inquiry_response_rp>(),
        1usize,
        concat!("Size of: ", stringify!(write_ext_inquiry_response_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<write_ext_inquiry_response_rp>(),
        1usize,
        concat!("Alignment of ", stringify!(write_ext_inquiry_response_rp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(write_ext_inquiry_response_rp),
            "::",
            stringify!(status)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct refresh_encryption_key_cp {
    pub handle: u16,
}
#[test]
fn bindgen_test_layout_refresh_encryption_key_cp() {
    const UNINIT: ::std::mem::MaybeUninit<refresh_encryption_key_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<refresh_encryption_key_cp>(),
        2usize,
        concat!("Size of: ", stringify!(refresh_encryption_key_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<refresh_encryption_key_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(refresh_encryption_key_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(refresh_encryption_key_cp),
            "::",
            stringify!(handle)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct refresh_encryption_key_rp {
    pub status: u8,
}
#[test]
fn bindgen_test_layout_refresh_encryption_key_rp() {
    const UNINIT: ::std::mem::MaybeUninit<refresh_encryption_key_rp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<refresh_encryption_key_rp>(),
        1usize,
        concat!("Size of: ", stringify!(refresh_encryption_key_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<refresh_encryption_key_rp>(),
        1usize,
        concat!("Alignment of ", stringify!(refresh_encryption_key_rp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(refresh_encryption_key_rp),
            "::",
            stringify!(status)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct read_simple_pairing_mode_rp {
    pub status: u8,
    pub mode: u8,
}
#[test]
fn bindgen_test_layout_read_simple_pairing_mode_rp() {
    const UNINIT: ::std::mem::MaybeUninit<read_simple_pairing_mode_rp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<read_simple_pairing_mode_rp>(),
        2usize,
        concat!("Size of: ", stringify!(read_simple_pairing_mode_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<read_simple_pairing_mode_rp>(),
        1usize,
        concat!("Alignment of ", stringify!(read_simple_pairing_mode_rp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(read_simple_pairing_mode_rp),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mode) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(read_simple_pairing_mode_rp),
            "::",
            stringify!(mode)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct write_simple_pairing_mode_cp {
    pub mode: u8,
}
#[test]
fn bindgen_test_layout_write_simple_pairing_mode_cp() {
    const UNINIT: ::std::mem::MaybeUninit<write_simple_pairing_mode_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<write_simple_pairing_mode_cp>(),
        1usize,
        concat!("Size of: ", stringify!(write_simple_pairing_mode_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<write_simple_pairing_mode_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(write_simple_pairing_mode_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mode) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(write_simple_pairing_mode_cp),
            "::",
            stringify!(mode)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct write_simple_pairing_mode_rp {
    pub status: u8,
}
#[test]
fn bindgen_test_layout_write_simple_pairing_mode_rp() {
    const UNINIT: ::std::mem::MaybeUninit<write_simple_pairing_mode_rp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<write_simple_pairing_mode_rp>(),
        1usize,
        concat!("Size of: ", stringify!(write_simple_pairing_mode_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<write_simple_pairing_mode_rp>(),
        1usize,
        concat!("Alignment of ", stringify!(write_simple_pairing_mode_rp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(write_simple_pairing_mode_rp),
            "::",
            stringify!(status)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct read_local_oob_data_rp {
    pub status: u8,
    pub hash: [u8; 16usize],
    pub randomizer: [u8; 16usize],
}
#[test]
fn bindgen_test_layout_read_local_oob_data_rp() {
    const UNINIT: ::std::mem::MaybeUninit<read_local_oob_data_rp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<read_local_oob_data_rp>(),
        33usize,
        concat!("Size of: ", stringify!(read_local_oob_data_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<read_local_oob_data_rp>(),
        1usize,
        concat!("Alignment of ", stringify!(read_local_oob_data_rp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(read_local_oob_data_rp),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).hash) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(read_local_oob_data_rp),
            "::",
            stringify!(hash)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).randomizer) as usize - ptr as usize },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(read_local_oob_data_rp),
            "::",
            stringify!(randomizer)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct read_inq_response_tx_power_level_rp {
    pub status: u8,
    pub level: i8,
}
#[test]
fn bindgen_test_layout_read_inq_response_tx_power_level_rp() {
    const UNINIT: ::std::mem::MaybeUninit<read_inq_response_tx_power_level_rp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<read_inq_response_tx_power_level_rp>(),
        2usize,
        concat!("Size of: ", stringify!(read_inq_response_tx_power_level_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<read_inq_response_tx_power_level_rp>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(read_inq_response_tx_power_level_rp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(read_inq_response_tx_power_level_rp),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).level) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(read_inq_response_tx_power_level_rp),
            "::",
            stringify!(level)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct read_inquiry_transmit_power_level_rp {
    pub status: u8,
    pub level: i8,
}
#[test]
fn bindgen_test_layout_read_inquiry_transmit_power_level_rp() {
    const UNINIT: ::std::mem::MaybeUninit<read_inquiry_transmit_power_level_rp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<read_inquiry_transmit_power_level_rp>(),
        2usize,
        concat!(
            "Size of: ",
            stringify!(read_inquiry_transmit_power_level_rp)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<read_inquiry_transmit_power_level_rp>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(read_inquiry_transmit_power_level_rp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(read_inquiry_transmit_power_level_rp),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).level) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(read_inquiry_transmit_power_level_rp),
            "::",
            stringify!(level)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct write_inquiry_transmit_power_level_cp {
    pub level: i8,
}
#[test]
fn bindgen_test_layout_write_inquiry_transmit_power_level_cp() {
    const UNINIT: ::std::mem::MaybeUninit<write_inquiry_transmit_power_level_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<write_inquiry_transmit_power_level_cp>(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(write_inquiry_transmit_power_level_cp)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<write_inquiry_transmit_power_level_cp>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(write_inquiry_transmit_power_level_cp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).level) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(write_inquiry_transmit_power_level_cp),
            "::",
            stringify!(level)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct write_inquiry_transmit_power_level_rp {
    pub status: u8,
}
#[test]
fn bindgen_test_layout_write_inquiry_transmit_power_level_rp() {
    const UNINIT: ::std::mem::MaybeUninit<write_inquiry_transmit_power_level_rp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<write_inquiry_transmit_power_level_rp>(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(write_inquiry_transmit_power_level_rp)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<write_inquiry_transmit_power_level_rp>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(write_inquiry_transmit_power_level_rp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(write_inquiry_transmit_power_level_rp),
            "::",
            stringify!(status)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct read_default_error_data_reporting_rp {
    pub status: u8,
    pub reporting: u8,
}
#[test]
fn bindgen_test_layout_read_default_error_data_reporting_rp() {
    const UNINIT: ::std::mem::MaybeUninit<read_default_error_data_reporting_rp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<read_default_error_data_reporting_rp>(),
        2usize,
        concat!(
            "Size of: ",
            stringify!(read_default_error_data_reporting_rp)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<read_default_error_data_reporting_rp>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(read_default_error_data_reporting_rp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(read_default_error_data_reporting_rp),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reporting) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(read_default_error_data_reporting_rp),
            "::",
            stringify!(reporting)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct write_default_error_data_reporting_cp {
    pub reporting: u8,
}
#[test]
fn bindgen_test_layout_write_default_error_data_reporting_cp() {
    const UNINIT: ::std::mem::MaybeUninit<write_default_error_data_reporting_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<write_default_error_data_reporting_cp>(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(write_default_error_data_reporting_cp)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<write_default_error_data_reporting_cp>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(write_default_error_data_reporting_cp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reporting) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(write_default_error_data_reporting_cp),
            "::",
            stringify!(reporting)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct write_default_error_data_reporting_rp {
    pub status: u8,
}
#[test]
fn bindgen_test_layout_write_default_error_data_reporting_rp() {
    const UNINIT: ::std::mem::MaybeUninit<write_default_error_data_reporting_rp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<write_default_error_data_reporting_rp>(),
        1usize,
        concat!(
            "Size of: ",
            stringify!(write_default_error_data_reporting_rp)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<write_default_error_data_reporting_rp>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(write_default_error_data_reporting_rp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(write_default_error_data_reporting_rp),
            "::",
            stringify!(status)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct enhanced_flush_cp {
    pub handle: u16,
    pub type_: u8,
}
#[test]
fn bindgen_test_layout_enhanced_flush_cp() {
    const UNINIT: ::std::mem::MaybeUninit<enhanced_flush_cp> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<enhanced_flush_cp>(),
        3usize,
        concat!("Size of: ", stringify!(enhanced_flush_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<enhanced_flush_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(enhanced_flush_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(enhanced_flush_cp),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(enhanced_flush_cp),
            "::",
            stringify!(type_)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct send_keypress_notify_cp {
    pub bdaddr: bdaddr_t,
    pub type_: u8,
}
#[test]
fn bindgen_test_layout_send_keypress_notify_cp() {
    const UNINIT: ::std::mem::MaybeUninit<send_keypress_notify_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<send_keypress_notify_cp>(),
        7usize,
        concat!("Size of: ", stringify!(send_keypress_notify_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<send_keypress_notify_cp>(),
        1usize,
        concat!("Alignment of ", stringify!(send_keypress_notify_cp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bdaddr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(send_keypress_notify_cp),
            "::",
            stringify!(bdaddr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(send_keypress_notify_cp),
            "::",
            stringify!(type_)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct send_keypress_notify_rp {
    pub status: u8,
}
#[test]
fn bindgen_test_layout_send_keypress_notify_rp() {
    const UNINIT: ::std::mem::MaybeUninit<send_keypress_notify_rp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<send_keypress_notify_rp>(),
        1usize,
        concat!("Size of: ", stringify!(send_keypress_notify_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<send_keypress_notify_rp>(),
        1usize,
        concat!("Alignment of ", stringify!(send_keypress_notify_rp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(send_keypress_notify_rp),
            "::",
            stringify!(status)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct read_log_link_accept_timeout_rp {
    pub status: u8,
    pub timeout: u16,
}
#[test]
fn bindgen_test_layout_read_log_link_accept_timeout_rp() {
    const UNINIT: ::std::mem::MaybeUninit<read_log_link_accept_timeout_rp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<read_log_link_accept_timeout_rp>(),
        3usize,
        concat!("Size of: ", stringify!(read_log_link_accept_timeout_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<read_log_link_accept_timeout_rp>(),
        1usize,
        concat!("Alignment of ", stringify!(read_log_link_accept_timeout_rp))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(read_log_link_accept_timeout_rp),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeout) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(read_log_link_accept_timeout_rp),
            "::",
            stringify!(timeout)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct write_log_link_accept_timeout_cp {
    pub timeout: u16,
}
#[test]
fn bindgen_test_layout_write_log_link_accept_timeout_cp() {
    const UNINIT: ::std::mem::MaybeUninit<write_log_link_accept_timeout_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<write_log_link_accept_timeout_cp>(),
        2usize,
        concat!("Size of: ", stringify!(write_log_link_accept_timeout_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<write_log_link_accept_timeout_cp>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(write_log_link_accept_timeout_cp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeout) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(write_log_link_accept_timeout_cp),
            "::",
            stringify!(timeout)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct read_enhanced_transmit_power_level_rp {
    pub status: u8,
    pub handle: u16,
    pub level_gfsk: i8,
    pub level_dqpsk: i8,
    pub level_8dpsk: i8,
}
#[test]
fn bindgen_test_layout_read_enhanced_transmit_power_level_rp() {
    const UNINIT: ::std::mem::MaybeUninit<read_enhanced_transmit_power_level_rp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<read_enhanced_transmit_power_level_rp>(),
        6usize,
        concat!(
            "Size of: ",
            stringify!(read_enhanced_transmit_power_level_rp)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<read_enhanced_transmit_power_level_rp>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(read_enhanced_transmit_power_level_rp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(read_enhanced_transmit_power_level_rp),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).handle) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(read_enhanced_transmit_power_level_rp),
            "::",
            stringify!(handle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).level_gfsk) as usize - ptr as usize },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(read_enhanced_transmit_power_level_rp),
            "::",
            stringify!(level_gfsk)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).level_dqpsk) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(read_enhanced_transmit_power_level_rp),
            "::",
            stringify!(level_dqpsk)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).level_8dpsk) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(read_enhanced_transmit_power_level_rp),
            "::",
            stringify!(level_8dpsk)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct read_best_effort_flush_timeout_rp {
    pub status: u8,
    pub timeout: u32,
}
#[test]
fn bindgen_test_layout_read_best_effort_flush_timeout_rp() {
    const UNINIT: ::std::mem::MaybeUninit<read_best_effort_flush_timeout_rp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<read_best_effort_flush_timeout_rp>(),
        5usize,
        concat!("Size of: ", stringify!(read_best_effort_flush_timeout_rp))
    );
    assert_eq!(
        ::std::mem::align_of::<read_best_effort_flush_timeout_rp>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(read_best_effort_flush_timeout_rp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(read_best_effort_flush_timeout_rp),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeout) as usize - ptr as usize },
        1usize,
        concat!(
            "Offset of field: ",
            stringify!(read_best_effort_flush_timeout_rp),
            "::",
            stringify!(timeout)
        )
    );
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct write_best_effort_flush_timeout_cp {
    pub handle: u16,
    pub timeout: u32,
}
#[test]
fn bindgen_test_layout_write_best_effort_flush_timeout_cp() {
    const UNINIT: ::std::mem::MaybeUninit<write_best_effort_flush_timeout_cp> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<write_best_effort_flush_timeout_cp>(),
        6usize,
        concat!("Size of: ", stringify!(write_best_effort_flush_timeout_cp))
    );
    assert_eq!(
        ::std::mem::align_of::<write_best_effort_flush_timeout_cp>(),
        1usize,
        concat!(
            "Alignment of ",
